[{"id":"gcQ4uUpNcI","date":"2020-07-19T15:38:30.409Z","rating":4,"description":"Co-op \/ Solo (Rise of fenris)","user":{"username":"Vucora","id":"Gd7ghgvUUq"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"6HrllkGD0T","date":"2020-05-01T01:36:54.974Z","rating":4,"title":"Spouse: Lo...","description":"Spouse: Love","user":{"username":"Imgembo","id":"1FlwojZBcK"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"JclqzBPo03","date":"2020-04-15T03:47:10.106Z","rating":4,"title":"Great game...","description":"Great game for any size group 2-5 and solid and challenging solo experience once you can learn the movement rules for the Automa","user":{"username":"Dmoyer0219","id":"WyjicLVbAR"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"nR815zNXfH","date":"2020-04-01T20:22:54.364Z","rating":5,"title":"Love this ...","description":"Love this game. Solid 10. It's not a 4X despite the looks. Solid solid worker placement with area control. Tons of different set-ups. Satisfying art. Nice minis (that smell of play-doh!) Once you know what you're doing play is fast fast fast! We can get a 3 or 4 player game done in 60-90 minutes. So satisfying.","user":{"username":"andybeta","id":"iBINPaJZ01"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"ZuQBwI4qpT","date":"2020-04-01T19:42:52.304Z","rating":3,"title":"This is a ...","description":"This is a solid area control \/ euro game, disguised as a war game. While the art and miniatures are top notch, I found the gameplay to be a bit... slow and plodding? I would definitely play it again, but I don't think that I would buy it for my collection.","user":{"username":"tylrprtr","id":"DpO6OsMpCQ"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"CiYKoGmmFs","date":"2020-04-01T18:31:45.970Z","rating":3,"title":"Decent gam...","description":"Decent game, but maybe too much emphasis on the production value (which is admittedly pretty good).","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"g51x1GjNP7","date":"2020-04-01T02:53:14.798Z","rating":3,"title":"Only one p...","description":"Only one play, but I enjoyed it.  It took a while to learn, but once you do go through everything the turns are really straightforward.  It's weird how all the boards are different and get mixed\/matched with each game, so it makes it sort of puzzly in what you get and what you can do each game.  Not sure if it makes a huge difference in the end or not.  I wasn't blown away, but the game was pleasant enough though it was slightly long, maybe that speeds up with more play.  I'm interested in exploring this further.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"fbI81BkdoP","date":"2020-04-01T02:18:41.976Z","rating":4,"title":"Great look...","description":"Great looking components and well thought out gameplay, but it's not as exciting as other games.","user":{"username":"TroyNyne","id":"FEjzD24EeL"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"X9gk7IdbL4","date":"2020-03-24T18:56:13.681Z","rating":4,"title":"I love tha...","description":"I love that this is a very well thought out strategy game and yet it's easy to learn the rules. I also like the fact that it isn't focused on combat, although you will need to combat other players every now and then. Excellent game, highly recommend it. Even more fun with 5 players.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"GvHFEbtOca","date":"2020-03-18T01:49:09.071Z","rating":4,"title":"Weight: 3....","description":"Weight: 3.36 \/ 5Includes Board ExtensionIncludes Legendary BoxIncludes Neoprene MatIncludes Metal Coins (base and green 2c\/purple 50c)Includes Kickstarter PromosIncludes Extra Promos (Meeplesource)Includes Purple and Green Battle WheelIncludes Encounter Expansion","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"yqR4PtpO8X"}}},{"id":"x5xMklqCFI","date":"2020-03-18T00:43:31.914Z","rating":4,"title":"1-5 player...","description":"1-5 players, asymmetrical 4x euro game, heavy weight, 120 minutes.Rating based on 3 solo games and 3 plays with 3 and 4 players. I can perfectly understand the hype, which was primarily based on art work and theme, and as far as I;m concerned the game delivers on its promise. The different factions all have their own unique abilities which make for a different game each play, also combined with the random player board, which calls for a different strategy each play.People looking for a heavy combat game will be dissapointed, as combat is minimal in the game, however the threat of combat is constant, which, in my view, works very well.I've tried a few games against the AI on easy (Autometta) and normal (Automata) level and that's also a nice experience, which allows you experiment a bit with the combinations and strategies. COnsidering to acquire additional Automa packs in orde to play against mutiple AI's. Also might consider buying the expansion, which adds two new factions to the game.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"yqR4PtpO8X"}}}]