[{"id":"qg7MBo8ZTW","date":"2020-07-26T12:52:46.574Z","rating":4,"description":"Worker placement with a unique \"capture\" mechanic for getting workers back to your board after using them and more efficiency for having more workers at a given site.","user":{"username":"WadeB1977","id":"HZhD1d3cMU"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"F7kmiAOsGY","date":"2020-07-26T12:22:22.068Z","rating":5,"description":"June 2020First play was tense. The dynamics were not instantly obvious. Also we generally avoid take that, so some of the capturing strategies probably won't play a big part of our games. I was a little worried that my wife didn't like it, but I could tell later that she was thinking about how to play it for the next time, so I think it is a keeper. Down the line I might try to adjust rules so that some capturing happens automatically, the initial thought is when you use the town center to get your own workers, you have to take half rounded down of anyone else's workers. If this doesn't work, maybe like 1 or something. I am not entirely sure the capturing is necessary, but I felt it appears to be a big part of the game, interrupting the other player's engine.June 2020BoardGameCo $24.26","user":{"username":"Wolfbearheart","id":"h5ZExFcIac"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"z9LNWj8Y6J","date":"2020-07-19T15:39:10.445Z","rating":4,"description":"Solo","user":{"username":"Vucora","id":"Gd7ghgvUUq"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"JvFGckSBuA","date":"2020-03-18T01:43:31.119Z","rating":4,"title":"Weight: 2....","description":"Weight: 2.75 \/ 5Includes promos and tax bin and metal coins","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"IMy2E7eTz4","date":"2020-03-18T00:14:31.946Z","rating":4,"title":"Rating bas...","description":"Rating based on 1st play","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"AKVnPJTj9H","date":"2020-03-09T15:10:23.581Z","rating":3,"title":"Played a h...","description":"Played a half game, I think better with more players. Interactive (for a euro). Probably a good \"second step\" for eurogames","user":{"username":"bwoller","id":"UtOazeQEfx"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"4Ipkkl8g2z","date":"2020-03-05T15:08:16.389Z","rating":4,"title":"I think I ...","description":"I think I bought this before Raiders. I like both, but I prefer Architects over (Base) Raiders (the 2 expansions helps Raiders a LOT IMO). To me, this is a great and light worker placement game. I like how you can get more resources by continuing to add more workers to a spot. I also like how Shem found a way to mitigate that by spending an action to imprison other people's workers. I also like how you can +\/- Reputation which can in\/prohibit you from taking certain actions on the board. Very interested to see what Artisans will bring to the game.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"bvhy96Pbuc","date":"2020-02-24T18:52:08.502Z","rating":4,"title":"Great work...","description":"Great worker placement game, in some parts remindes me of Village, which i also like .","user":{"username":"deresh","id":"RoHWExpixO"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"UBZExNjF3q","date":"2020-01-29T15:31:46.371Z","rating":5,"title":"Great fami...","description":"Great family strategy game! Multiple paths to victory and game plays pretty quickly! Fun fun!","user":{"username":"ferkno77","id":"ZkuszB9JzV"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"AjftDXK3AC","date":"2020-01-26T03:18:11.825Z","rating":2,"title":"Pedestrian...","description":"Pedestrian worker-placement. The vaunted differences (worker cycling, virtue track) don't add much of anything.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"IROqoGAEUs","date":"2020-01-25T07:10:51.460Z","rating":5,"title":"Expansions...","description":"Expansions:\n- Kickstarter Extras\n- West Kingdom Mini Card Set\n- Garphill Games 5-Year Anniversary Promo Pack\n- Paladins Apprentices\n\nAn amazing combination of worker placement with engine building. Has the right amount of conflict with other players while not being too mean. Turns run quickly and the game doesn't out stay its welcome.","user":{"username":"GossamerSolid","id":"IwHp4RNkLJ"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"UimuoCMx2l","date":"2020-01-25T01:22:42.500Z","rating":3,"title":"Need more ...","description":"Need more plays","user":{"username":"velebni","id":"L1fH0xj1zr"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"0QECdoZI7i","date":"2020-01-22T00:33:40.778Z","rating":4,"title":"This playe...","description":"This played incredibly quick. A lot of times these worker placements in first plays take a while. Really liked this one. Maybe the only thing I didn’t love was the Take That option but it wasn’t terrible either.","user":{"username":"Seamusk","id":"pHEXtCAFl5"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"C5VuWmFtwn","date":"2020-01-03T22:31:48.968Z","rating":4,"title":"Worker pla...","description":"Worker placement with multiple workers permitted in most of the regions, and a better benefit the more workers a player has after the placement. One action allows rounding up groups of workers and then money may be gained for imprisoning them.","user":{"username":"Avron","id":"rZRAVFlqOc"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"M8g8MjA3iE","date":"2019-12-20T19:22:19.935Z","rating":4,"title":"Such a gre...","description":"Such a great flow to this game. No downtime, interesting decisions, no real take that but a lot of player interaction. Adding that I like quite a few games more but the pacing and game flow elevate the rating.","user":{"username":"poypoyking","id":"1ANb7tY2Cm"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"LOWo6bLMyj","date":"2019-12-11T22:33:16.088Z","rating":4,"title":"Really enj...","description":"Really enjoyed the flow, but it just didn't hit our table's sweet spot. A friend owns my copy now, so it's not out of my life.","user":{"username":"JoeAubrey","id":"xpjKPMmCF1"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"wlTP7j27Gz","date":"2019-12-03T19:31:10.241Z","rating":3,"title":"Another wi...","description":"Another winner for Shem and Renegade. I like that you can always place a worker in almost any location. There is an interesting puzzle in trying to balance building buildings, working on the cathedral, and collecting resources. I like the art style and the  clear iconography. This is definitely a must buy for me,","user":{"username":"rarroyo","id":"76P6FtbgDC"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"3Y0YOXwrKq","date":"2020-02-02T20:33:38.911Z","rating":3,"title":"Ok Game","description":"A unique worker placement game with the option of using asymmetrical characters (reason i picked up this game).\nHowever with its uniqueness comes some negatives. The fact others can capture other peoples workers might be off putting to some.\nIt has its issues in terms of balance as well. If say no one but you captures workers, the player who captured them will lose due to tempo loss. If no one captures workers the game will simply be the same but now each player would need to reclaim a worker every turn after. \nMy biggest complaint is that the most generic and simple way of winning the game (working on the cathedral) seems to be the most effective and there is a specific character who does that.\nHowever if you're simply looking to get a casual, slightly different more interactive gameplay where your group isn't afraid of using the capture mechanic then this game is for you.\nAnd yes luck influences this game quite a bit, but without it there would be no replayability.\n\nWill update if the new expansion fixes any of the issues listed above.","user":{"username":"Bóndi","id":"0Tl225MCLS"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"XiREpwSrWO","date":"2019-11-07T18:15:28.590Z","rating":5,"title":"Worker pla...","description":"Worker placement","user":{"username":"Fizberry","id":"UWSGRbfFGs"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"OFQDnGMG8D","date":"2019-11-06T17:28:10.958Z","rating":4,"title":"I've enjoy...","description":"I've enjoyed it more with a higher player count than 2.","user":{"username":"alchain31","id":"2uV1IA8Vqj"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"FJQkU5PRN6","date":"2019-10-25T19:37:33.380Z","rating":4,"title":"Great twis...","description":"Great twist on worker placement. Start with a whole pile of workers and make decisions about when to get them back. More workers on a single location makes that location more powerful for you. Actions to limit other players' powerful locations. Synergies with apprentice cards. Play either 'with nobility' or 'wickedly', with advantages to both and paths to victory for either.","user":{"username":"ccmonter","id":"sJFzVKgdg1"},"game":{"id":{"objectId":"omFfdCNOD1"}}},{"id":"6G2trcQjAl","date":"2019-06-26T23:21:45.844Z","rating":4,"title":"Very fun a...","description":"Very fun and engaging worker placement.  Not sure if I would prefer to have this or Raiders of the North Sea.  But probably Raiders just to be able to play the Rune Saga.","user":{"username":"Urtho","id":"CWxqX7Up0X"},"game":{"id":{"objectId":"omFfdCNOD1"}}}]