[{"id":"72ORkYBLHI","date":"2020-05-03T22:42:22.364Z","rating":4,"title":"GREAT. I l...","description":"GREAT. I love it. This is one of the games that I enjoy and love to play ANYTIME. I am not sure if this stays the same after a while, so I gave it a 9 instead of 10.","user":{"username":"fzerorubigd","id":"2WmvkhpCwW"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"ZqlCVmC0Jg","date":"2020-04-01T19:23:46.649Z","rating":2,"title":"A few inte...","description":"A few interesting mechanics but overall wasn't terribly impressed. The cards didn't allow you to build a tight engine, and the randomness of the cards you could buy and had to rely on made it so you really could be flat out stuck.","user":{"username":"stainedglasshouse","id":"U6D1P24KqU"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"QPH5w1T1yi","date":"2020-03-18T01:44:51.673Z","rating":4,"title":"Weight: 2....","description":"Weight: 2.21 \/ 5","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"a8pJ4HT5ms","date":"2020-03-18T00:19:41.896Z","rating":4,"title":"Deckbuildi...","description":"Deckbuilding dungeon crawler, also very suitable to play with non-gamers, friends and family. Works pretty well, the rules are easy to learn and the iconography on the board is very clear. I also like the push your luck element, will you go deep underground in search for the better treasures, risking you won't make it out in time? Or will you race back to the exit to get nice bonus points and trigger end game while the other adventurers are still....well, adventuring","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"p2QUYQRIwQ","date":"2020-03-09T15:10:34.577Z","rating":3,"title":"Deck-build...","description":"Deck-builder with a board. Cool concept, I wish cards felt more unique and had interesting interactions. Push your luck element ends up feeling boom or bust.","user":{"username":"bwoller","id":"UtOazeQEfx"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"IdHC1RH7Sn","date":"2020-02-26T18:04:59.342Z","rating":4,"title":"Starts off...","description":"Starts off slow and then ramps up.  Great game!  The mark of a truly good game is when you can't wait to start playing it after you finish a session.  Looking forward to playing again.","user":{"username":"xmorridin","id":"bGnYPyAeQi"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"KOAyS7OFTD","date":"2020-02-25T17:45:40.971Z","rating":3,"title":"Very good ...","description":"Very good idea for deckbuilder. Felt a bit sour after 3rd game ended the same way as previous two - with one player grabing the first treasure and bolting out. Seemed like so much more potential just got not used. We played the smaller side of the dungeon and we're hoping that the bigger side fixed that problem a bit more.","user":{"username":"paka","id":"rp47DWzo8q"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"MFw9m5Yk9s","date":"2020-02-05T16:03:15.202Z","rating":4,"title":"I almost b...","description":"I almost bought this game, but opted for a game that featured worker placement and dice rolling, because I felt like I already had enough deckbuilders. But still, I want to own this one, because there are enough other mechanics in the game that don't let the deckbuilding aspect take over. I've only played it once, but I rather enjoyed it, and would like to give it another go to try different strategies. Very enjoyable exploration!","user":{"username":"BackBurnerGames","id":"bLRwfwEKuF"},"game":{"id":{"objectId":"07FXm6tX4o"}}},{"id":"ilnASVA6QM","date":"2020-01-26T18:22:55.936Z","rating":4,"title":"I won't sa...","description":"I won't say this is my favorite deck builder but it might be the one I have the most fun playing. I'm still coming to grips with exactly what that means.\n\nI like that's it's competitive without being too cutthroat. It's possible to adversely affect your opponent by trying to incite dragon attacks or by snatching loot out from under their noses but it all seems really good-natured.\n\nI like that there are different ways to build out your deck and so there are a number of ways to win.\n\nIt's fun to try to decide if you want to push your luck to go a little deeper or stay in the dungeon a little longer. It's very satisfying to count your loot at the end.\n\nI've played solo a couple of times with the app. It's okay but I vastly prefer playing with other folks and there are other games I would prefer to solo.\n\nAll in all, I'd say this one was a winner and I'd happily play anytime.","user":{"username":"Kbieb","id":"a14hHC8tAx"},"game":{"id":{"objectId":"07FXm6tX4o"}}}]