[{"id":"a0ywQ1agf2","date":"2020-08-05T15:23:36.507Z","rating":3,"description":"I really enjoy the gears and how they actually work as a time mechanism - not a gimmick! A great game with lots of options. Somewhat restricting though.","user":{"username":"povertidonki","id":"eqPHRjtz0E"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"AClSR5tnQN","date":"2020-08-04T14:32:38.316Z","rating":5,"description":"On order...","user":{"username":"Susie_Cat","id":"rSfEYzMbkT"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"y21R5YQDHU","date":"2020-04-14T20:22:49.137Z","rating":5,"title":"Lots to wr...","description":"Lots to wrap my mind around with this - it's definitely one of my favorite worker placement game and I absolutely love that the moving gears aren't a gimmick. This is a wonderful game for anyone looking to venture into slightly more heavy mid-weight euros.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"Xr3FepGz5e","date":"2020-04-14T20:22:47.422Z","rating":5,"title":"Lots to wr...","description":"Lots to wrap my mind around with this - it's definitely one of my favorite worker placement game and I absolutely love that the moving gears aren't a gimmick. This is a wonderful game for anyone looking to venture into slightly more heavy mid-weight euros.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"W77aykDxya","date":"2020-04-01T02:54:10.885Z","rating":2,"title":"Seems to b...","description":"Seems to be just another worker placement game of which there are plenty.  This one does stand out with an interesting timing mechanic of placing your workers and deciding to let them ride to more powerful actions or pull them off and get them on other things.It was alright, but I didn't see anything in it that made it mind blowing.  I'd play it again, but I wouldn't seek it out.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"TySKc7RIEJ","date":"2020-03-25T01:35:22.444Z","rating":1,"title":"just don't...","description":"just don't like itbut can see why other do","user":{"username":"paris1979","id":"hnZcaO8d7j"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"vQ9jxGtoTx","date":"2020-03-18T01:49:29.613Z","rating":4,"title":"Weight: 3....","description":"Weight: 3.63 \/ 5Includes Folded Space insertTraded 1 copy for Camel Up + $10Traded 2nd copy for $35","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"ISdMXqPOiq","date":"2020-03-18T00:44:26.452Z","rating":5,"title":"Designer: ...","description":"Designer: Simone Luciani, Daniele Tascini Artist: Milan VavroňPublisher: CGE (Czech games Edition)Player count: 2-4 (best with 4)Weight: heavyMechanics: worker placementSetting: Players are different Mayan tribes Theme: fairPlay time: 90-120 minutesThe game looks great, has a cool theme and adds something to the worker-placement genre through the introduction of the cart wheel which turns all the other wheels, so you have to pay attention when you place and take off your meeples. As you're only allowed to either place or take off meeples in your turn, timing is probably more important here than in any other game I know. An additional factor too add some complexity is the starting player space. When you claim this you receive all the food (corn) which was placed there in previous turns, but also you have the opportunity to turn the wheels twice instead of once, which can seriously mess with other players plans.Every cart wheel has it's own purpose: food and wood, resources, development and buildings, trade and workers and lastly offerings to the gods. Basically, you need everything and can't neglect any wheel, but the number of workers is very limited and like I said, you can only put workers on one or more wheels or take them off. As the longer they remain on the wheel, the better the reward, so you'd like to keep all of them on as long as possible, which you can't. This part is soooo hard to master, and I'm still learning with every game.To summarize, this game is highly recommended and has been in my top 10 for a couple of years now.Can't wait to play again","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"Zqfhw8BOfz","date":"2020-03-02T19:55:10.789Z","rating":3,"title":"Started tr...","description":"Started tracking games late. Add about 3 to the number of plays. I like this game well enough, but man am I terrible at it. I've since found better worker placement games for my play style, but I probably wouldn't turn down a game of this.","user":{"username":"RyanLopez","id":"s1SvjLpi66"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"YYSny8XXAZ","date":"2020-02-09T15:14:30.947Z","rating":3,"title":"I give it ...","description":"I give it a 6 only for the originality of the board design. Otherwise it would be a 4 based on 1 play of a 4 player game.\n\nI was able to win the game while ignoring large portions of the game the entire time. ","user":{"username":"CaptainPossum","id":"AC457UrGjQ"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"ywJEUPXav8","date":"2020-02-03T18:15:26.173Z","rating":4,"title":"Innovation and tough, but great!","description":"I love the wheel mechanic with the worker placement.... incredible.","user":{"username":"WineScar","id":"31makDwKZA"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"ORrI8vFWYx","date":"2020-01-26T03:53:06.939Z","rating":3,"title":"The standa...","description":"The standard billion options that all end up in roughly the same place kind of worker placement game. Not a huge knock, to be sure, but I have pretty settled preferences in that most crowded of genres (Tribune all the way).","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"v0rqg7mMfR","date":"2020-01-13T17:07:44.921Z","rating":4,"title":"Excellent ...","description":"Excellent game with lots to think about. Lovely board and artwork.","user":{"username":"sugarmeeple","id":"h4nd7ZV5hu"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"e3TpUKIw9r","date":"2020-01-03T22:58:37.122Z","rating":3,"title":"Place one ...","description":"Place one or more of you workers on the gears, at the earliest available space(s). Or take one or more of your previously placed workers back and take the appropriate action(s). Apart from the details of the actions and the feeding that's basically the game.\nI continue to score poorly compared to my opponents usually. Not struggling to feed normally, but scoring well, from temples especially, eludes me.","user":{"username":"Avron","id":"rZRAVFlqOc"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"XJ4EszeQLg","date":"2019-12-20T22:41:03.825Z","rating":3,"title":"Typical wo...","description":"Typical worker placement game with an interesting, albeit gimmicky gears mechanic.","user":{"username":"AndyMesa","id":"dW0VtNrQ1u"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"2WeGgoXXJU","date":"2019-12-12T17:38:29.926Z","rating":4,"title":"Okay, so t...","description":"Okay, so the gears are a bit of a gimmick but they work. There's so much strategy and planning and tension in this game. \n\nALWAYS play with the Tribes and Prophecies expansion.","user":{"username":"smwoz17","id":"pOp3KFNl0D"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"AZ3yiNMnsz","date":"2019-12-11T22:37:11.706Z","rating":4,"title":"Another ga...","description":"Another game that throws a wrench in my brain. I really want to explore this more just to understand it.","user":{"username":"JoeAubrey","id":"xpjKPMmCF1"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"lCfVP0yFpN","date":"2019-10-30T15:35:33.569Z","rating":4,"title":"Garritt's ...","description":"Garritt's game","user":{"username":"billcoke","id":"GEOjNX5SfT"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"P9Rxc7BGk6","date":"2019-10-25T19:46:34.764Z","rating":4,"title":"Brilliant ...","description":"Brilliant design.  I enjoy worker placement and the pay-me-now-or-pay-me-later mechanism in this game is excellent.  A worker placement where getting more workers is NOT a primary objective?  Nice!\nOf course, the theme is A+++ for me.\n\nThe only problem is that the game is prone to analysis paralysis, specially in the later rounds.\n\nINCLUDED: \nTzolk'in: The Mayan Calendar – Tribes & Prophecies","user":{"username":"ccmonter","id":"sJFzVKgdg1"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"iHf6WbAKQ4","date":"2019-10-20T21:53:03.157Z","rating":4,"title":"With [thin...","description":"With [thing=143065][\/thing]","user":{"username":"LoquaciousMonk","id":"iDuMGDsFs2"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"1gv7YjRKwV","date":"2019-10-18T18:28:06.211Z","rating":3,"title":"4.11.18\nTz...","description":"4.11.18\nTzolkin is a worker placement game, the catch being that workers go on the teeth of various cogs and, as the main cog signifying the calendar rotates, the actions you can take become increasingly better. This game reminded me of a more complex Stone Age that has removed the dice. There are different resources that need converting, buildings to build, and grunts to feed. I have a few hesitations about how the currency (i.e., corn) affect game play, which is why I rated this a 7, but I could see raising the score to an 8 after exploring the game more.\nThoughts after the first play. \n\nPROS\n-The board, with its moving gears, is incredibly unique. It’s hard to think of a regular board game with a more interesting presence. In terms of components, the crystal skulls stand out while the other cube resources are satisfactory. \n-Big, big fan of the artistic style of the game. \n-The different paths to explore—corn, skulls, buildings, monuments, temples, and technology—keep the game from getting stale and let advanced players explore untried strategies while playing with inexperienced players.\n-The starting tiles are excellent! I love the idea that these aid your decision in which strategy you will take.\n\nCONS\n-Corn is a constant and sometimes insurmountable problem. In our game, not one player got another worker for fear of having to feed him. I managed to grab the farm tile that allows a player to feed three of workers and I believe this is the reason I won. In order to stay afloat, it seems that you have to have a worker on the corn wheel at all times and you have to have the tech that allows you to harvest from exhausted fields. I could see gathering sufficient corn limiting a player’s enjoyment of the game as it is such a central focus but also a boring chore when compared with all of the other interesting actions you want to be taking. \n-While focusing on corn, you also need to be amassing cube resources but the wheel where you do this offers infuriatingly few cubes. This seemingly means you need to decide if you want to go for buildings OR monuments but I would be hard pressed to see how you could do both as monuments are incredibly exorbitant. Again, not one player was able to purchase a monument.","user":{"username":"gidorah","id":"asfNJJc1Lr"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"09rA3j2TQj","date":"2019-10-17T14:27:22.852Z","rating":2,"title":"Gift from ...","description":"Gift from Sam, Nov. 2014.","user":{"username":"indigopotter","id":"fdFvxs6OrD"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"ZnfB32TrhE","date":"2019-09-30T15:14:23.141Z","rating":4,"title":"2-4 Player...","description":"2-4 Players\n90 Minutes","user":{"username":"JohnMunsch","id":"HcGw7lC0za"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"BnBphVbMIA","date":"2019-04-12T18:22:13.223Z","rating":3,"title":"The gears ...","description":"The gears in this game add some complexity to a worker placement game.  I enjoyed the second game a lot more once we got to grips with the rules.\nThe gears provide a timed strategy to work towards and therefore you didn't feel that the game outlived its welcome.","user":{"username":"Robertcompton","id":"Z2vesScdom"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"MnLuL4G6Vc","date":"2019-03-01T19:15:13.095Z","rating":4,"title":"No need to...","description":"No need to sleeve","user":{"username":"ion514","id":"5m4MFdG580"},"game":{"id":{"objectId":"aD2aeY8DEP"}}},{"id":"N625ZfDOxK","date":"2019-02-21T16:24:04.982Z","rating":4,"title":"Need to pl...","description":"Need to play more, but seems solid so far.","user":{"username":"BrouhahaGames","id":"BMYTY7hJMs"},"game":{"id":{"objectId":"aD2aeY8DEP"}}}]