[{"id":"R7EqHe4KSw","date":"2020-08-01T07:23:35.358Z","rating":5,"description":"Love it! It's a racing game, don't believe what anybody else tells you. It only takes as long as you allow it to, as my partner repeatedly reminds me by destroying me very quickly every time we play.","user":{"username":"Perchy","id":"XyM3iXdu83"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"toMLkXbo8C","date":"2020-07-26T12:22:15.259Z","rating":5,"description":"April 2020$21 BoardGameCo","user":{"username":"Wolfbearheart","id":"h5ZExFcIac"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"a2SZCTEsSh","date":"2020-04-12T13:35:59.074Z","rating":5,"title":"We started...","description":"We started playing this on the iPad on a recent holiday and liked it so much we went and got the physical version.Great game, we’re still playing with the recommended setup. We haven’t seen dominant paths\/players as other reviews have called out. I think if everyone has similar experience with the game, no single player is allowed to get to far ahead.Looking for forward to getting more plays of this one and at least the mocha expansion, maybe the dice version as well..... Great iPad game as well.","user":{"username":"NeilGordon","id":"Ahchq6lnef"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"nPCBlyGHN4","date":"2020-04-01T18:30:40.658Z","rating":3,"title":"I predict ...","description":"I predict this will become a classic Euro. Has all the parts--dull theme, wooden pieces, fast gameplay, no elimination, balanced. Unique movement mechanic.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"ixnARPwvkB","date":"2020-04-01T02:51:08.959Z","rating":2,"title":"Typical Eu...","description":"Typical Euro these days.  It's okay, but it's not something I'm seeking out or playing by my own suggestion, but if it's in front of me I'll play I guess.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"uxhnM0koxK","date":"2020-04-01T02:17:52.346Z","rating":4,"title":"Fun game -...","description":"Fun game - plays quick.  After 6 games I do wonder how long it will last without an expansion though.","user":{"username":"TroyNyne","id":"FEjzD24EeL"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"DMNB1JLSlC","date":"2020-03-18T01:45:41.092Z","rating":4,"title":"Weight: 2....","description":"Weight: 2.59 \/ 5Includes wooden insert with plastic overlays","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"EhGkVXIQPr","date":"2020-03-18T00:41:22.862Z","rating":4,"title":"The game p...","description":"The game plays pretty easy and fast, there's little down time. It takes a few turns before you know all the tiles, but then it's fairly straightforward. You gather goods, sell these for money and buy rubies or instead deliver them to the sultan for rubies.The Sultan's route is a bit more complex, as you'll need blue goods (jewelry) as well, which cannot be gathered at the warehouses, but need to be won by throwing dice (7 or up gets you one or more Jewels). People who usually are unlucky with dice can avoid this by acquiring a card that lets you buy jewely at the warehouses or a different card that allows you to change one die of throw again.As you need to leave your assistants behind (to take care of the paper work or something), you need to plan your route carefully. Luckily, you can always return to the fountain and recall your assistants there.The fun part is that you encounter people on your way, other Merchants, the governour, the smuggler or one of the \"nephews\", either your own or someone elses. The other Merchants have to be paid off before they allow you to perform the action, the governour and the smuggler allow you to buy cards or goods and the nephews can be sent to jail for a reward. You can even turn in your own kin. All in all, Rudiger Dorn has put together another nice game. I see some resemblance to one of his earlier games Waka Waka, where the same goods (fruits, spices and silk) can be gathered and delivered for more status. We like that game as well, but this one is certainly more developed. As this is a modular board (all the 16 tiles of the market can be set up randomly), the most efficient way of moving around varies per game, so replayability is high. There's a nice alternative play as well, where one of your assistants has a neutral colour and can therefore be taken by one of your opponents.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"4XZSCuhFYA","date":"2020-02-14T22:08:23.702Z","rating":4,"title":"Upgraded t...","description":"Upgraded to the Big Box.","user":{"username":"g6grim","id":"zukWhgG8u5"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"QGUws8oj7I","date":"2020-01-28T20:42:41.888Z","rating":4,"title":"Best game ...","description":"Best game for couples that want a bit more depth. Its still easy to play, but feels different enough every time","user":{"username":"Dashing_Pixel","id":"HFOTzOeWPq"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"OrF6kjsnzE","date":"2020-01-28T15:42:32.226Z","rating":4,"title":"A decent E...","description":"A decent Euro, with the ability to change the board between games. Unfortunate end-game though - as it's often clear that a player has won a couple of turns before it happens.","user":{"username":"Effervex","id":"oXk0xfkRr7"},"game":{"id":{"objectId":"b1nBQaNdH6"}}},{"id":"tiJmaIWcPX","date":"2020-01-28T06:04:52.316Z","rating":4,"title":"****Coffe ...","description":"****Coffe expansion","user":{"username":"Abulense","id":"DttwlhgAYM"},"game":{"id":{"objectId":"b1nBQaNdH6"}}}]