[{"id":"TYCvjaUCBe","date":"2020-05-07T21:09:44.319Z","rating":5,"title":"","description":"This game evokes a grand space opera feeling like none other - the political negotiating, threatening, and cajoling, daring maneuvers to conquer the heart of an opponent's empire, nasty tactical traps that leave the victim wondering what just happened. The scale of this game is massive, yet it comes together in an astoundingly coherent whole. The game can't be called anything less than truly grand. The dumbness of the game keeps it exciting, somehow - the randomness of the card draw and the dice rolls can truly wreck you, but it really feels like part of the experience. For almost every situation where a leader looks all but guaranteed to win, there is a slim but possible way for the table to form a ramshack coalition and play the odds to stop them. I've never seen a game where people can go from quietly smug to soiling-their-pants anxious so quickly. It's stupid and brilliant and epic, and it's so Twilight Imperium.","user":{"username":"Stads","id":"zLsXtzwcNz"},"game":{"id":{"objectId":"5tnoVda0AY"}}},{"id":"fWUN67dLET","date":"2020-01-26T03:52:59.573Z","rating":1,"title":"I mean, it...","description":"I mean, it's a marginal improvement over the disgrace that is TI:3, so I gave it a half a point bump--the tech tree is much more user-friendly. Other than that, my comment for TI:3 stands:\nSetting aside the fact that it encourages turtling, setting aside the fact that the rules are a poorly-worded affront to usability, setting aside the grotesquely unbalanced everything (cards, chits, powers, etc. etc.) that have a huge effect on the game state, setting aside the fact that the victory conditions are at best stale and at worst utterly broken, setting aside the fact that the components themselves are some of the least user-friendly I've seen... Wait, what was I getting at?\nOh, yeah. Setting aside all that, there's precious little to actually do! You're always constrained by artificially-imposed bottlenecks or the simple fact that in this \"epic\" 8 hour monstrosity you basically just play weaksauce Puerto Rico in space and slowly move your lumbering fleets around.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"5tnoVda0AY"}}},{"id":"Stzaa8EoL7","date":"2019-12-15T19:23:41.487Z","rating":5,"title":"","description":"What at first seemed like an overwhelming and incomprehensible product soon shifted into an intriguing and exciting experience that I was lucky enough to convince my gaming group to go all in on. After a great sale my friend blind-bought the game to contribute to the group, and within a month we had 6 of us studied up and ready to play. We assigned homework to read through the manual, to watch playthrough explanation videos, and to research the specific race we were going to play so we could more readily jump into the inevitably long experience. Our first playthrough was about 7 hours, and we were careful to have 10 minute breaks between each round and have a solid lunch break in the middle so no fatigue set in come the end game. Everyone had a great experience, and the longer we played the more we hungered for future playthroughs with the many different races and outcomes that we'd be able to experience. It's a massive game, and it takes a lot of time and attention to bring it to the table and play it efficiently, but it's an incredibly engaging and rewarding experience if you put forth the effort.","user":{"username":"Trystonian","id":"XyAVDLeTHK"},"game":{"id":{"objectId":"5tnoVda0AY"}}},{"id":"gzpBElNhWp","date":"2019-04-12T18:22:11.321Z","rating":4,"title":"First game...","description":"First game of the new edition 2\/12\/2017","user":{"username":"Robertcompton","id":"Z2vesScdom"},"game":{"id":{"objectId":"5tnoVda0AY"}}},{"id":"5gipCHzCZT","date":"2019-03-06T15:13:22.722Z","rating":4,"title":"For the lo...","description":"For the longest time this was my holy grail game, decadence in the form of cardboard and plastic, so once the fourth edition came out I had to grab it. So happy to have finally played and I think it lived up to the expectation and I will definitely be pushing to play this more","user":{"username":"NeutralPlatypus","id":"rbOy98rNqV"},"game":{"id":{"objectId":"5tnoVda0AY"}}}]