[{"id":"ArGOtji2he","date":"2020-03-24T18:54:38.986Z","rating":3,"title":"What's not...","description":"What's not to love about this game? Its competitive, full of meaningful decisions that you have to make, fun and clever.I have played Ascension before this and my faith in deckbuilding games weren't too strong. Dominion restored that faith The ability to play a little different every time with different Kingdon card piles is amazing. I'm definitely buffing up my game with more expansions.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"6VQXkkC5ql"}}},{"id":"So2NglTGfa","date":"2020-02-28T01:35:50.389Z","rating":4,"title":"The standa...","description":"The standard in Deck building. The granddad of all deck builders. A classic.","user":{"username":"BGillz81","id":"wxvBXzSKgJ"},"game":{"id":{"objectId":"6VQXkkC5ql"}}},{"id":"oNUME7rtB5","date":"2020-02-03T17:47:01.739Z","rating":2,"title":"1st ever deck building game, but there are better ones now","description":"Innovation is great, but the theme here is bland and I don't enjoy playing it anymore.","user":{"username":"WineScar","id":"31makDwKZA"},"game":{"id":{"objectId":"6VQXkkC5ql"}}},{"id":"GChc7xHvEG","date":"2019-10-25T19:40:15.683Z","rating":4,"title":"I didn't k...","description":"I didn't know if I would like Dominion, but I had to try it. This is an awesome game! The combination of varied gameplay and short playing time is fantastic.  The game is both strategic and tactical and plays different each time.  Fabulous design.\n\nINCLUDED: \nDominion: Intrigue\nDominion: Seaside \nDominion: Prosperity \nDominion: Alchemy","user":{"username":"ccmonter","id":"sJFzVKgdg1"},"game":{"id":{"objectId":"6VQXkkC5ql"}}},{"id":"NnEQfpRysV","date":"2019-10-18T16:55:58.210Z","rating":5,"title":"When I fir...","description":"When I first discovered Dominion, my group and I played many times a week for over a year and a half (albeit with several of the expansions) before we finally tired of the game. And after a few-month break, it has again become our go-to option to start any game night.\n\nI don't like games of chance; I want to win by out-strategizing my opponents. Dominion shines as a game about _mitigating_ chance. Yes, you still have to rely on the luck of the draw for any given hand, but it's up to you to build a deck with increasingly favorable drawing odds.","user":{"username":"enjayem","id":"HH9pg0LUFY"},"game":{"id":{"objectId":"6VQXkkC5ql"}}}]