[{"id":"tJWr2E8F1W","date":"2020-08-05T15:19:15.103Z","rating":5,"description":"One of the best engine building games there is. Short and fast with experienced players. This is a go to super filler for any game night.","user":{"username":"povertidonki","id":"eqPHRjtz0E"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"wmPoKcOdlC","date":"2020-08-04T14:32:19.872Z","rating":5,"description":"One of our current favourite games, we were given this as part of the 2009 Secret Santa.****Keeper - Great game and it was a gift that we treasure.","user":{"username":"Susie_Cat","id":"rSfEYzMbkT"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"kNzYc5votR","date":"2020-08-01T07:24:18.417Z","rating":4,"description":"Not NEARLY as good as I thought it was... It's fast and it's good for the first few times you play it, but once you understand how everything works it just becomes a bit bland. There are 4 different types of good, but they're all the same except some are more valuable. They don't do anything really... Yeah I don't know, I feel like the game needs more meat, it just lacks a bit of something. After every game I just feel a bit lacking.","user":{"username":"Perchy","id":"XyM3iXdu83"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"WXbzfCIaLC","date":"2020-07-20T14:02:24.708Z","rating":4,"description":"Would rate higher if more people would play. It has a barrier to entry... keeps people away.","user":{"username":"Jon Dante","id":"x2tLaqb9Tw"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"JGZB2Kyjjf","date":"2020-04-15T15:37:18.407Z","rating":2,"title":"Haven't Pl...","description":"Haven't Played Yet.","user":{"username":"Stallworth","id":"zDUsEMPFEj"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"Ak0LRsDIk1","date":"2020-04-02T01:33:11.975Z","rating":3,"title":"Available ...","description":"Available on Steam - don't own but would consider it! Also here online but it's \"premium\" https:\/\/boardgamearena.com\/gamepanel?game=raceforthegalaxy","user":{"username":"derbius","id":"FKop3gaFsM"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"dTY77TPHtY","date":"2020-04-01T18:31:30.347Z","rating":3,"title":"If you've ...","description":"If you've played San Juan (a good game), then this is one with similar mechanics, but with more cards, more mechanics, and a more exciting theme. What's not to like?The first few plays were frustrating, as I was learning the game and all its iconography. It's not as much fun when you feel rushed by those who choose their roles in two seconds every turn. Much more fun when some thought is put into it, and a few minutes are spent at the end reflecting on your galactic civilization. I have to give mention to the excellent artwork on every single card in this game. Very impressed!","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"KpuhbvwHb5","date":"2020-03-18T00:43:12.425Z","rating":4,"title":"2-4 player...","description":"2-4 players, 30-45 minutes, medium heavy, deck buildingI love this game, especially with two players this is a fast deck building race game. No game is the same with different starting planets and so many cards that come along during the game. Most logged games are online (BGA), but this has also become one of the main fillers in our gaming group, especially for two of us, where we usually throw in one of the expansions.Trying to get my son (10) into playing this one as well","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"9i83zOhWy8","date":"2020-03-09T23:11:05.682Z","rating":5,"title":"Absolutely...","description":"Absolutely fantastic game which I cannot get enough of. Love trying different strategies, even the \"under-powered\" ones. Expansions should give this a very long life.","user":{"username":"opticode","id":"GOBGDBMHVT"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"u9DMmSW6cf","date":"2020-03-04T19:42:32.572Z","rating":3,"title":"This is on...","description":"This is one of those games that is incredibly difficult to get your head around at first.. but is actually pretty strait forward.I hated it the first few times I played it, but I have to say it's grown on me..","user":{"username":"antiussentiment","id":"jqE5Gn3RFW"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"CdocWINiQo","date":"2020-02-28T23:04:12.794Z","rating":5,"title":"Getting ba...","description":"Getting back into this after some tutelage from experienced players.  I'm going to teach it to bar night boys.[09-15-14] Weston really hated it!  I'm still having trouble getting my head that.","user":{"username":"permagoof","id":"EE9k3rx1UU"},"game":{"id":{"objectId":"E4ELA8cG85"}}},{"id":"KBzmOxOuRf","date":"2020-02-25T17:57:33.803Z","rating":3,"title":"That MtG b...","description":"That MtG bug just made me buy it. Sadly wife doesn't want to learn it while likeing San Juan. Missing quite a few plays before started recording","user":{"username":"paka","id":"rp47DWzo8q"},"game":{"id":{"objectId":"E4ELA8cG85"}}}]