[{"id":"XfiumxFPCH","date":"2020-07-19T15:38:31.119Z","rating":4,"description":"Co-op","user":{"username":"Vucora","id":"Gd7ghgvUUq"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"7ZgwJWlG4Z","date":"2020-07-15T18:15:02.214Z","rating":4,"description":"Has Broken Token insert","user":{"username":"07734","id":"OeawAe30Dc"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"2WzBZKgtev","date":"2020-05-21T13:57:35.738Z","rating":5,"title":"One of my favs","description":"I love this game. I enjoy anything that creates interesting and unpredictable interactions between people. Each character having their own objective is a great way to spread distrust. Lots of variable player  powers and hidden hands prevents quarter-backing and we always play that with the crossroads cards you don't describe exactly what will happen mechanically, just the narrative always makes it more tense. Love being the traitor but also really enjoy being a regular person as the game gives you plenty of choose even then.","user":{"username":"Courageous Bob","id":"vYQtEV9o0A"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"MGnwyhayIk","date":"2020-04-14T20:18:11.823Z","rating":3,"title":"Wonderful ...","description":"Wonderful game with a pain-in-the-ass setup, but well worth if you have an invested group of gamers. Thematically on key, visually appealing, and great quality of components. Not my favorite, but a gem in its own right.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"lZs5QZteE5","date":"2020-04-02T01:43:39.033Z","rating":4,"title":"In love wi...","description":"In love with this game. Will never turn down an opportunity to play it!","user":{"username":"Reddit","id":"zHbinHHKcE"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"90KtUtvvBN","date":"2020-04-01T18:27:02.543Z","rating":2,"title":"A zombie-t...","description":"A zombie-themed BSG of sorts. Borrows some mechanics from various games. In addition to BSG, it also shares ideas from Mall of Horror (locations with characters attract zombies), Castles of Burgundy (roll dice, then choose action based on die results), and Robinson Crusoe (events, crises, food\/item requirements). Would be much less interesting without a betrayer, IMO.My only criticisms are that 1) the voting mechanic doesn't work well. There should be 2 tiles (one \"Y\" and one \"N\") for each player to use rather than the simultaneous thumbs up, thumbs down.2) The players can either make or break the game. Like most \"experience\" games, the mood of others at the table can affect the gaming experience in both positive and negative ways.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"9BzIOJjFf3","date":"2020-04-01T02:41:19.636Z","rating":2,"title":"I only tho...","description":"I only thought this game was okay.  Maybe it would be better if I were in a different mood, but when I played this, I thought it took entirely too long and wasn't really fun.  I thought there was no reason I should work with the group because if I did, I would not be able to complete the goals why would I want to help my group, therefore, everyone in the game basically became a traitor to the group because they wouldn't work with anyone.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"k3cftPiLbe","date":"2020-03-24T18:05:07.555Z","rating":5,"title":"Have playe...","description":"Have played this four times so far and introduced it to a new group of people each time, everyone has loved it! The mechanics are great and the threat can really mount up quickly if your not careful.An amazing game","user":{"username":"Mythiqa","id":"W6hzE6pPMQ"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"fOW7jKtmEd","date":"2020-03-18T00:25:38.027Z","rating":4,"title":"Fun game, ...","description":"Fun game, would like to play again. May become part of my collection.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"i5ApelCK3b","date":"2020-03-09T15:10:41.779Z","rating":2,"title":"Co-op, Wal...","description":"Co-op, Walking Dead themed. Very mediocre. Either too hard or too easy. Supposed to have a hidden traitor mechanic but never play with it.","user":{"username":"bwoller","id":"UtOazeQEfx"},"game":{"id":{"objectId":"y56td93iXw"}}},{"id":"L3DRrpLUjt","date":"2020-03-07T03:11:51.959Z","rating":4,"title":"2-5","description":"2-5","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"y56td93iXw"}}}]