[{"id":"WSkt8ChEEn","date":"2020-06-20T04:02:01.236Z","rating":5,"title":"A Galaxy of possibilities","description":"Incredible game with almost unlimited options and variability. Seems daunting at first but halfway through the first game something clicks and the game unfolds before  your eyes. Can’t wait to play this one over and over again.","user":{"username":"Skurvy5","id":"Z9Tvibr6QK"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"F9ZuYrbOmz","date":"2020-04-14T20:19:01.317Z","rating":5,"title":"Speechless...","description":"Speechless. Masterclass in game design.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"Z1rTbUa7mF","date":"2020-03-24T18:55:05.130Z","rating":3,"title":"This is de...","description":"This is definitely not for me. The decisions are good, theme is good, but it’s the type of game you need to play again and again to become proficient at it. I’m not a fan of these.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"ydEzoG9EX6","date":"2020-03-18T01:45:23.991Z","rating":3,"title":"Weight: 4....","description":"Weight: 4.29 \/ 5Includes Folded Space insert","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"LIH1GGaupU","date":"2020-03-18T00:40:47.405Z","rating":4,"title":"1-4 player...","description":"1-4 players, best with 3-4, medium heavy, 90-120 minutes. Reimplementation of Terra Mystica with a space theme. I really like TM and GP is a smoother game so have traded TM away (shelf space is limited...), although I do feel the 2 can easily co-exist.Really like the them and mechanics and have played several games now with 1-4 players, which all work quite well.Recommended!","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"E1D5CYRVyy","date":"2020-01-26T03:45:35.033Z","rating":3,"title":"It's Terra...","description":"It's Terra Mystica in space, all right. One hopes that the factions are better balanced, but I was never good enough at Terra Mystica to care.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"AhAstsAdr7","date":"2020-01-25T00:22:59.280Z","rating":5,"title":"This game ...","description":"This game is brilliant. You start off feeling so poor you're groaning whenever it's your turn. From there you spend ten minutes trying to figure out what (if anything) you can squeak out of this super tight system. And then all of a sudden, you get to do stuff. Not as much as you'd like to, but still way more than you have been. And it feels so satisfying. You earned that tiny little mining colony and you're proud of it. This is the most immersive game I've played in a long time. I got done with a 2.5 hr game late at night and I honestly just wanted to play again.\n\nTM vs Gaia: Get TM if you want something a bit tighter with fewer options. Get Gaia if you want more ability to chain moves together in interesting ways. I personally prefer Gaia, but they're similar enough that it's just a small matter of preference. (Also TM supports 5 players, and Gaia supports 1 player.)","user":{"username":"warder57","id":"iaobIrOTQm"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"3a5wy1rwlh","date":"2019-12-12T17:36:09.414Z","rating":4,"title":"What Terra...","description":"What Terra Mystica should have been. At least at 2 players. Outstanding game. ","user":{"username":"smwoz17","id":"pOp3KFNl0D"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"pwErcAz126","date":"2019-12-11T22:35:47.297Z","rating":4,"title":"A game tha...","description":"A game that captured my imagination and made me want to play again and again, but since I didn't own a copy, I didn't get it played soon enough. And now I feel like I'd have to relearn all those basic lessons again and going back isn't as appealing.","user":{"username":"JoeAubrey","id":"xpjKPMmCF1"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"SG2vsFjnWc","date":"2019-11-03T01:17:39.614Z","rating":4,"title":"Love this ...","description":"Love this game.  3 plays and 3 different strategies for winnging because of the asymmetric races.","user":{"username":"Level 1","id":"0VDKQ7Ao5W"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"UL4dP8R952","date":"2019-10-25T19:41:18.941Z","rating":4,"title":"A great re...","description":"A great re-implementation of a great game.","user":{"username":"ccmonter","id":"sJFzVKgdg1"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"hnVJKV1cdA","date":"2019-09-09T17:09:37.475Z","rating":5,"title":"This will MELT YOUR FACE OFF","description":"All of the actions in this game seem simple on the surface, but everything is intertwined and ultra complex. There is a lot to wrap your mind around at any given point from tracking your resources, to what is scoring this round, to \"which tech track is ideal for my faction\". There is a lot happening, but the payoff is a wonderful, enticing game that gets more interesting with each play.","user":{"username":"nealkfrank","id":"CyqawCwHn9"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"AYEGngWFGp","date":"2019-06-15T03:32:14.455Z","rating":4,"title":"8.7 \/ 2-4p...","description":"8.7 \/ 2-4p Best 3-4 \/ 60-150m \/ 4.30  (Improves on Terra Mystica, Jon strategic game #2)","user":{"username":"JayferX","id":"OftL22qFK2"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"nxKbQTsREy","date":"2019-01-23T14:27:21.675Z","rating":3,"title":"While I or...","description":"While I originally was smitten with this game, I've cooled on it significantly. I think it works as a \"sense of discovery\" game, which I mistook for a game that would inspire mastery. Turns out I quickly got bored of playing the same faction more than once, and found myself picking sub-optimally simply to try something else, rather than pick the obvious choice.\n\nI get that there are people who dive into this game headfirst and it will probably have similar staying power to Terra Mystica for many, but I've sort of squeezed out of this game what there is is to squeeze out.\n\nIt still has that TM problem where the game is essentially decided at setup. With Dominion, it's less of a crime, but in a 3-hour game it becomes a grind.\n\nMy opinion of it goes down every time I play it.","user":{"username":"Brent","id":"MQlPznxyCZ"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"P6iPdXIjML","date":"2019-01-22T05:53:39.319Z","rating":5,"title":"My favourite heavy euro","description":"Only two of my games have a plywood insert. One is Twilight Imperium, the other one is this.","user":{"username":"The_Omnius","id":"1kyqFxW0n2"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"Q9oMrLDlPz","date":"2019-01-22T04:32:08.029Z","rating":5,"title":"Any game I...","description":"Any game I can play for hours and hours and not notice how much time has passed is top notch. The build-up to that one huge move, the balance between tactics and strategy, the ability to destroy the plans of others or see yours destroyed because your \"friend\" built a better federation than you out of nowhere: all of these factors make for a fantastic game.\n\nI also like the math crunch that occurs in the last two* rounds and the weird balancing act of rewinding your buildings to jive with the round scoring. \n\nThis game might become a 10 for me.\n\n*Experts are probably crunching the entire game.","user":{"username":"thingamarob","id":"fE012I3zwD"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"8oLZyRmKgE","date":"2019-01-16T17:53:17.270Z","rating":4,"title":"Just jumpe...","description":"Just jumped into this one on release without having played Terra Mystica. This game is all about that tech tree and using your faction with the initial setup to get the most out of it. Really good solo option and the 2-player game is quite fun. ","user":{"username":"svenv","id":"yWHHZvqNUM"},"game":{"id":{"objectId":"yPwGVk8lB2"}}},{"id":"YQd0FX637c","date":"2019-01-11T05:01:00.935Z","rating":4,"title":"Gaia Proje...","description":"Gaia Project improves upon the, albiet few, shortcomings of its predecessor, Terra Mystica. Most obviously, the bland Cult tracks and Favor tokens, have been replaced with a fabulous tech tree system, which equips players with various ways to customize their abilities, income, and point scoring methods. However, the biggest improvement is the variable End Game contests. Where Terra Mystica's end game was static and uninteresting, Gaia forces players to compete for new objectives, giving each game a distinct focus. Mix this with the myriad of races, and technology tiles, and players will have a new puzzle to crack with each play. I still dislike the overbearing round scoring tiles, but Gaia improves just about everything else.","user":{"username":"ekloff","id":"a8RJxg0qVT"},"game":{"id":{"objectId":"yPwGVk8lB2"}}}]