[{"id":"gsvE3QId8y","date":"2020-04-01T18:31:01.446Z","rating":4,"title":"It seems t...","description":"It seems to be the best game as an adventure-type slay monsters and level up type of game. Magic Realm is just too outdated and overly-complex. MK, while not perfect, is a reasonable alternative. An Ameritrash game that takes a lot of unnecessary randomness out--a hybrid then? What's more is that it is a good game to play solo, although I much prefer it multiplayer. My gripes with it (admittedly minor) are the ugly card art and miniature figurines. The art is good quality, in fact, but the depiction of human(oid) creatures is where it fails. The art on the cards is very colorful and effective, and certainly is an improvement over cards with no art at all. I'm not a huge fan of deck-building, but there's enough of the game outside of this mechanic to make it fun. It's more hand management than deckbuilding, since you aren't required to discard your hand at the end of your turn, and aside from Wounds, there aren't any completely useless cards (I'm looking at you, Dominion). The icons work well, and I have to mention that the art and site locations on the terrain tiles are of excellent quality and make for very clear gameplay. This game is certainly heavy and fiddly with a few rules exceptions, but it's worth every bit of the struggle to get there. Everything is thematically intuitive as well as important for game balance. Oh, and in case it matters, I know nothing of the original Mage Knight minis game or the MK setting.I rate it a 9.5 as a two or three player game. I rate it a 7 as a solo and co-op game (I dislike using an artificial timer, plus I'm generally averse to solo games in general). I haven't played it with 4 yet. I imagine I would enjoy it as long as it was with fast players who are very comfortable with the game. Full Conquest is my favorite scenario, but I also enjoy Druid Nights and Mines Liberation for variety. In Full Conquest, I play mainly 2 player, and use the variant to add 1 extra countryside tile and 1 extra non-city core tile to setup. This allows for some extra Fame to be earned. We were conquering the cities well-before the end of the 3rd night because we were running out of places outside the cities to get Fame. 19 of my logged plays are solo, which don't really count for a game that can be played multiplayer.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"exdy1Z2bSC"}}},{"id":"peCO2xzx42","date":"2020-04-01T02:51:30.703Z","rating":2,"title":"A little t...","description":"A little too long, and not enough going on for my taste.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"exdy1Z2bSC"}}}]