[{"id":"AGivfiJoS1","date":"2020-08-01T18:37:05.797Z","rating":3,"description":"Very confusing first play. It's a difficult game to teach and understand. And for it to work best everyone really needs to understand how each other faction works and what they're doing.","user":{"username":"stroutqb22","id":"nFLSgFAsbh"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"8icMfZ8viy","date":"2020-07-15T18:56:13.261Z","rating":4,"description":"Includes Riverfolk & Underworld & Clockwork expansions","user":{"username":"truthwritten","id":"g3u3awmgbH"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"DLO2AGKWkV","date":"2020-05-01T01:36:40.220Z","rating":5,"title":"Spouse: Lo...","description":"Spouse: Love: I will say this. It is a 10 for me but I love everything about it. I can absolutely understand if some one would hate this game.","user":{"username":"Imgembo","id":"1FlwojZBcK"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"57yruuHBNN","date":"2020-04-02T01:33:15.830Z","rating":4,"title":"https:\/\/st...","description":"https:\/\/steamcommunity.com\/sharedfiles\/filedetails\/?id=12976... using TTS","user":{"username":"derbius","id":"FKop3gaFsM"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"bJcTGMYHkH","date":"2020-04-01T20:22:47.139Z","rating":4,"title":"Preliminar...","description":"Preliminary rating. Played a couple of times with family. Not so hard to teach as it looks. Youngest played vagabond to avoid being attacked. Worked well.Feels great fun, not as long as I thought it would take. Will almost certainly increase rating over time. Want to play all four Factions first.Additions: We have noticed that the game starts slow, and speeds up dramatically during the mid-late game. Point scoring accelerates and a win can come from nowhere if you're not watchful. I think I've played everything except Vagabond so far (everyone wants to be the Vagabond.) Some seem harder to get the most out of, but they're all fun to play.Even my youngest (10) can play Vagabond and Marquise with some effectiveness.There's certainly an overhead to teaching this game, and it needs repeated play to get the most out of it. It reminds me of a GMT COIN game, with its asymmetric player abilities, area control and card-driven mechanisms.Cutesy artwork belies a cut-throat and brutal game that, once you have the hang of it, plays quickly and almost always ends leaving you wanting more.Not convinced about the solo-play out of the box. I need to try the enhanced solo factions from the Files section.","user":{"username":"andybeta","id":"iBINPaJZ01"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"I4pGAAEHJk","date":"2020-04-01T19:42:49.975Z","rating":5,"title":"This is th...","description":"This is the gateway to asymmetrical games like Viticulture is to worker placements. Cole Wehrle and Co. have perfectly distilled the COIN-like\/war gameplay and crammed it in an approachable package. Every turn presents grueling choices of furthering your own goals or going out of your way to hamper your opponents. The game can be a bear to teach, but with the fact that all factions share some base rules regarding movement, card crafting, and battling, plus the 2 turn walkthrough, you can get the game moving within 15-20 minutes.","user":{"username":"tylrprtr","id":"DpO6OsMpCQ"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"flgLd9E7FK","date":"2020-04-01T17:52:52.267Z","rating":5,"title":"After mult...","description":"After multiple plays, I see this as the go to war game for my group.","user":{"username":"lpdustin","id":"r4LuipS5w6"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"T4ieBaD5Rj","date":"2020-04-01T09:43:19.016Z","rating":4,"title":"","description":"Fantastic asymmetrical war game but do note that it takes a few plays to really appreciate and the players need to balance the game by dynamically keeping the leader in check from turn to turn.","user":{"username":"Kent38","id":"u4lLBhPlKD"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"7QJGaSDaAR","date":"2020-04-01T02:18:39.364Z","rating":4,"title":"+ great ar...","description":"+ great art+ every game feels different + fun gameplay - difficult to learn- too wordy on the player mats - hard to know what every player is doing","user":{"username":"TroyNyne","id":"FEjzD24EeL"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"nnDQC5iUCy","date":"2020-03-24T18:56:12.003Z","rating":4,"title":"What an am...","description":"What an amazing game. Truly asymmetric characters makes the game replay-ability a core feature. Had a great time playing the Vagabond and Marquise De Cat, and can't wait to play the other characters!","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"vXCd8Wjev9","date":"2020-03-18T01:49:06.993Z","rating":4,"title":"Weight: 3....","description":"Weight: 3.41 \/ 5","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"wNF6rAHesD","date":"2020-03-05T15:09:02.100Z","rating":4,"title":"One of my ...","description":"One of my newer games. Area control. Asymmetrical. Love the theme. Love the game play.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"0UQpSYAMdl","date":"2020-03-02T19:21:24.710Z","rating":5,"title":"Finally pl...","description":"Finally playing this game with 4 players sealed the rating at 10 for me.  I love the asymmetry and the tilting of the balance of power.","user":{"username":"gokiburijin","id":"dj9ROCj0WW"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"EVnzO4UZy1","date":"2020-03-01T19:25:48.459Z","rating":4,"title":"Kickstarte...","description":"Kickstarted.","user":{"username":"ChasetheAdventure","id":"HA1ffitZa8"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"73lzEpYuMM","date":"2020-02-26T07:04:22.418Z","rating":5,"title":"No Review Title","description":"No Review Description","user":{"username":"Zoron","id":"ZuDdury3pW"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"ZZQBVrX8sa","date":"2020-02-23T18:38:51.324Z","rating":2,"title":"The only c...","description":"The only competitive game I've played with a quarterbacking problem. The second someone does well for playing their faction the way it should be played, one player screams \"get em, boys!\" and everyone piles on, knocking that player out of the running for the rest of the game. I appreciate the design, but in practice, I've hated it every time.","user":{"username":"jdhun017","id":"CFFhWqbdSn"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"RD2qigfoV6","date":"2020-06-04T18:04:27.441Z","rating":5,"title":"A Cute Wargame for Non-Wargame Fans","description":"This game is fantastic. The appeal to this game lies in the variable play styles of each of the factions. Each one will make you want to play the game over and over again to master it. This game is deceptively heavy though. The rulebook(s) for this game are some of the best I have read in all of my games, but it is still a very difficult teach. I can't recommend this game to everybody, but those that are interested by the mechanics and theme should absolutely try this game.","user":{"username":"Xarbnot87","id":"IG4YzFDfwa"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"7KJl8hiYHG","date":"2020-01-28T20:42:46.179Z","rating":4,"title":"Want to ge...","description":"Want to get this to a more advanced group whenever I can. The theme and abstract gameplay are simply magnetic. It is incredible hard to teach to a group, but so rewarding once the rules are understood.","user":{"username":"Dashing_Pixel","id":"HFOTzOeWPq"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"LBnjDTRgIb","date":"2020-01-26T03:50:09.320Z","rating":4,"title":"This is a ...","description":"This is a pretty cutthroat game in a very charming package. Infinitely better than the execrable Vast, and preferable in all ways to the obtuse COIN games. The asymmetry is as massive as reported, but for the most part everyone knows how to mess with everyone else--a point where many asymmetric games accidentally become too difficult to play.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"Ft4jzBisbp","date":"2020-01-25T19:22:13.504Z","rating":4,"title":"1 play, ea...","description":"1 play, early rating. will get adjusted later","user":{"username":"Ni84d0@@m0Zc","id":"ayHNBHUVC4"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"6Gpvqm0jzH","date":"2020-01-25T00:25:26.448Z","rating":4,"title":"Fun asymme...","description":"Fun asymmetric war game. The art and theme are just amazing. It's an interesting system to explore but the experimentation is the fun part. I definitely want to dig into this more, particularly with the expansion coming out soon(ish). My only qualm is that you need to play this with people who know what they're doing because the game's balance comes from the players, not the system.","user":{"username":"warder57","id":"iaobIrOTQm"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"xu1bjCr9kV","date":"2020-01-13T19:21:55.481Z","rating":5,"title":"Not very d...","description":"Not very difficult to teach for the first game, due to the walkthrough being very clear. My gaming group loves this game.","user":{"username":"Port","id":"wGqWsG8yB4"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"OxVYHoZI2q","date":"2019-12-20T22:39:16.134Z","rating":4,"title":"Now that I...","description":"Now that I've played Root in its finished form with all of the factions, I feel I can finally speak about it. The beauty of Root, above all else, is that it can get on the table. I love COIN games, Fire in the Lake is a masterpiece, but I haven't played it in *years* because I just can't get it on the table. I've played Root with casual gamers that would never play a COIN game, but happily played this. I think that is the game's biggest achivement, bringing asymmetric wargames to the masses. I look forward to exploring it more.","user":{"username":"AndyMesa","id":"dW0VtNrQ1u"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"XgHACb1h62","date":"2019-12-05T20:32:38.515Z","rating":4,"title":"A masterpi...","description":"A masterpiece of game design - both due to the balanced asymmetry and how well each faction's theme matches with their mechanics.\n\nNot giving this a 10 because, while the asymmetry is brilliantly balanced and thematic, the gameplay felt a bit shallow at times. Still a really fun game.","user":{"username":"jerdude","id":"QfiJiogW5s"},"game":{"id":{"objectId":"TAAifFP590"}}},{"id":"UzEJqVC8Vd","date":"2019-12-03T18:53:18.548Z","rating":4,"title":"Location: ...","description":"Location: Kallax","user":{"username":"lexjudex","id":"CGBCFjYBAn"},"game":{"id":{"objectId":"TAAifFP590"}}}]