[{"id":"6fXEf81ieo","date":"2020-08-05T15:20:17.162Z","rating":5,"description":"The best real time game I have played. The puzzly aspect of building your ship is only enhanced by having to make decisions as fast as possible. Flying through space can be harsh, but that fits the theme of the game.","user":{"username":"povertidonki","id":"eqPHRjtz0E"},"game":{"id":{"objectId":"A38ipJ48QE"}}},{"id":"7vyZeKWtvn","date":"2020-07-20T14:02:09.097Z","rating":4,"description":"One of my most played games. I think I just love the chaos. Only problem being is that I can't play with inexperienced gamers.","user":{"username":"Jon Dante","id":"x2tLaqb9Tw"},"game":{"id":{"objectId":"A38ipJ48QE"}}},{"id":"Y6G7g1PANC","date":"2020-04-04T15:31:19.260Z","rating":4,"title":"PLAYED IT WRONG","description":"My game group really likes this game inspite of the fact that i recently figured out weve been playing it wrong and making it a million times harder than it has to be. My one complaint is the rule book is a little too \"JOKEY\" and hard to follow. Now that we have a lock on it were looking fwd to hitting the open space roads again soon .","user":{"username":"Denomfug","id":"1LxSbLd0YD"},"game":{"id":{"objectId":"A38ipJ48QE"}}},{"id":"IJnWAVu5Rg","date":"2020-04-01T18:30:30.994Z","rating":2,"title":"Not really...","description":"Not really sure what to say about this one. Certainly a different \"style\" of game than what I'm used to. Will take more plays to see it's staying power, but the first game was fun.Update: I've played the iPad app which is incredibly well done. I enjoy it in that format especially playing with my son. I think this makes a good family game.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"A38ipJ48QE"}}},{"id":"LFt0pxYFML","date":"2020-04-01T02:49:11.554Z","rating":4,"title":"Alright, I...","description":"Alright, I know this game is kind of Random, and it's goofy, and it's not exactly short, or groundbreaking or anything.But it is freaking fun.  And watching your ship blow up from one meteor perfectly placed is entertaining (albeit disheartening).","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"A38ipJ48QE"}}},{"id":"evULoED8VO","date":"2020-03-24T20:34:09.203Z","rating":3,"title":"I love the...","description":"I love the real-time grabbing elements!!APP ONLY","user":{"username":"princetonwong","id":"62dn1tmxwO"},"game":{"id":{"objectId":"A38ipJ48QE"}}},{"id":"0W9De1QYpC","date":"2020-03-23T20:15:07.799Z","rating":3,"title":"Played onc...","description":"Played once with two players...basically a learning game.  My guess is that my rating will go up if I play again with more than two players.","user":{"username":"wylde_karde","id":"yU0KryVJVp"},"game":{"id":{"objectId":"A38ipJ48QE"}}},{"id":"8z5x84qOBC","date":"2020-03-18T00:40:47.799Z","rating":4,"title":"Designer: ...","description":"Designer: Vlaada Chvátil (Dugeon Petz, Dungeon Lords, Mage Knight)Publisher: CGEPlayer count: 2-4 (best with 4)Weight: Medium lightMechanics: tile laying \/ real timeSetting\/theme: science fictionPlay time: 60 minutesRating based on a handful of games with 2 and 3 players, which was a lot of fun. The rules are clear and sometimes hilarious and so is the game. Should not be taken too serious, sometimes almost a party game.Verdict: keeper","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"A38ipJ48QE"}}}]