[{"id":"0v90EUDr48","date":"2020-04-14T20:20:17.905Z","rating":4,"title":"Absolute b...","description":"Absolute blast if you have friends who are as into Lovecraftian horror as you are. Difficult, but not unbeatable. The \"app\" component is an insanely welcome addition and a unique take on having players play against the game.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"qujLDDoos4","date":"2020-04-14T20:20:17.795Z","rating":4,"title":"Absolute b...","description":"Absolute blast if you have friends who are as into Lovecraftian horror as you are. Difficult, but not unbeatable. The \"app\" component is an insanely welcome addition and a unique take on having players play against the game.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"UJb21KRFGU","date":"2020-04-01T19:00:13.586Z","rating":3,"title":"*Disclaime...","description":"*Disclaimer: The listed rating\/10 is heavily weighted towards my enjoyment of the game and the experience that it provides. Each pro and con are factored individually towards a cumulative score, but do not have fixed increments in which they can detract or increase a rating.Pros:+ Incredibly Thematic+ Intuitive Mechanics+ App Streamlines the Game+ Captivating StorytellingCons:- Too Long- Over Reliant on App- Mythos Phase is Slightly Tedious- Poor Miniatures- Overpriced","user":{"username":"Bryle","id":"lLhNFG8GGJ"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"ZPTGNwqZ7o","date":"2020-03-24T18:56:01.651Z","rating":3,"title":"Now that's...","description":"Now that's the kind of game I love. Has RPG mechanics twisted in a new and fun way and the app works really well as a GM and keeping track of everything happening with the players and monsters. I love tile placing games and the scenarios are very fun to play - I will definitely buy expansions when I run out of scenarios!The mechanics for combat and actions are simple enough and don't drag.The board and cards art are really great but the minis could have been better - the first edition has minis which the quality is visibly superior.Playing alone is incredibly fun. I found myself cursing at my dice roll and cheering when I found some great item in the mansion. The game is very hard, but I do like it this way. Overall, an amazing game!","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"2EQ5k0n4FT","date":"2020-03-07T03:12:12.820Z","rating":4,"title":"1-5","description":"1-5","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"Zspd2nNHfz"}}}]