[{"id":"fA6CyTYgXq","date":"2020-08-01T18:36:51.230Z","rating":3,"description":"My girlfriend loves this game! The minitures do not stay in their bases well at all, I might have to glue them in soon, but I really wish we could get them painted first.We played this game just the two of us the first two times and we found it veryyy difficult. For the third play we each played two characters and it made the experience much better and we actually won. I'm pretty sure we'll always take the extra characters.","user":{"username":"stroutqb22","id":"nFLSgFAsbh"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"KjWgCLf2dB","date":"2020-07-26T02:01:17.032Z","rating":4,"description":"Co-op \/ Solo","user":{"username":"Vucora","id":"Gd7ghgvUUq"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"0v90EUDr48","date":"2020-04-14T20:20:17.905Z","rating":4,"title":"Absolute b...","description":"Absolute blast if you have friends who are as into Lovecraftian horror as you are. Difficult, but not unbeatable. The \"app\" component is an insanely welcome addition and a unique take on having players play against the game.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"qujLDDoos4","date":"2020-04-14T20:20:17.795Z","rating":4,"title":"Absolute b...","description":"Absolute blast if you have friends who are as into Lovecraftian horror as you are. Difficult, but not unbeatable. The \"app\" component is an insanely welcome addition and a unique take on having players play against the game.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"UJb21KRFGU","date":"2020-04-01T19:00:13.586Z","rating":3,"title":"*Disclaime...","description":"*Disclaimer: The listed rating\/10 is heavily weighted towards my enjoyment of the game and the experience that it provides. Each pro and con are factored individually towards a cumulative score, but do not have fixed increments in which they can detract or increase a rating.Pros:+ Incredibly Thematic+ Intuitive Mechanics+ App Streamlines the Game+ Captivating StorytellingCons:- Too Long- Over Reliant on App- Mythos Phase is Slightly Tedious- Poor Miniatures- Overpriced","user":{"username":"Bryle","id":"lLhNFG8GGJ"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"ZPTGNwqZ7o","date":"2020-03-24T18:56:01.651Z","rating":3,"title":"Now that's...","description":"Now that's the kind of game I love. Has RPG mechanics twisted in a new and fun way and the app works really well as a GM and keeping track of everything happening with the players and monsters. I love tile placing games and the scenarios are very fun to play - I will definitely buy expansions when I run out of scenarios!The mechanics for combat and actions are simple enough and don't drag.The board and cards art are really great but the minis could have been better - the first edition has minis which the quality is visibly superior.Playing alone is incredibly fun. I found myself cursing at my dice roll and cheering when I found some great item in the mansion. The game is very hard, but I do like it this way. Overall, an amazing game!","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"2EQ5k0n4FT","date":"2020-03-07T03:12:12.820Z","rating":4,"title":"1-5","description":"1-5","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"HxdJh1Z7Pe","date":"2020-03-04T19:42:17.079Z","rating":2,"title":"OK but a b...","description":"OK but a bit slow and stilted for my liking.  A bit too much down time between turns in what is basically constrained role playing.","user":{"username":"antiussentiment","id":"jqE5Gn3RFW"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"TyUB2urEqT","date":"2020-02-03T23:24:31.781Z","rating":4,"title":"I want mor...","description":"I want more!","user":{"username":"Abysmul","id":"m0lvkCFxfB"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"WvxebahlBB","date":"2020-01-31T20:46:16.788Z","rating":4,"title":"Fantastic ...","description":"Fantastic story telling game.  I love how the app is so fluid with the board game.  I can't imagine this game without the app.  I love how the story is just so involved and you finish the game with such a wonderful experience.  One thing is this game is so HARD!! I mean trying to make the dice roll is so hard, but still a fine game.","user":{"username":"wallawalla4591","id":"8BduD9e5gV"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"huWl0Iq0Ed","date":"2020-01-03T19:32:51.299Z","rating":3,"title":"Germany","description":"Germany","user":{"username":"magicjavelin","id":"8aheBN0Rp0"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"UKATxmt2Zi","date":"2019-12-20T05:30:09.335Z","rating":4,"title":"1-5 player...","description":"1-5 players (best 3-4)\n120-180 minutes","user":{"username":"noduh","id":"cTCpFZpDMC"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"FGUtnGnI1b","date":"2019-12-12T17:37:06.797Z","rating":3,"title":"The app in...","description":"The app integration is really neat and works great. Definite Betrayal killer. ","user":{"username":"smwoz17","id":"pOp3KFNl0D"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"aB0eRz28jk","date":"2019-10-29T07:08:12.331Z","rating":3,"title":"Too cumber...","description":"Too cumbersome to set up to be a real classic in my mind, but solid fun when we do actually get it together and play.","user":{"username":"3MBG","id":"Iq8eBovdNm"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"ZaZFxjrcGf","date":"2019-08-08T18:42:48.646Z","rating":4,"title":"Fantastic ...","description":"Fantastic game. Easy to learn and takes only about 5 minutes to teach. Surprised at how well the app integrates into the experience. I am now excited to try other games from FFG that have an app available.\n\nUpdate: the game always goes much longer than the suggested time. If you have too many players it can drag on and people can lose interest. As people lose interest turns take longer causing even more people to loose interest. While it is quick to learn, make sure you can play with people that can stay focused or play at lower player counts.","user":{"username":"tellingson00","id":"U1umQn52pD"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"r7C4sDvZ7M","date":"2019-08-05T17:08:15.872Z","rating":4,"title":"A fun expe...","description":"A fun experience that feels casual enough to enjoy with almost any group -- but lacks the complexity and depth that you'd sometimes hope it'd have, especially if playing with a group that can handle it. Overall the gameplay flows very well with the app, which surprised me.","user":{"username":"BuckZero","id":"h8gHDeYVTV"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"8RHOnJQD0K","date":"2019-06-26T23:23:22.675Z","rating":3,"title":"Does every...","description":"Does everything I think Betrayal tries to do, but makes it feel like a game is happening.  Far more immersive and fun.","user":{"username":"Urtho","id":"CWxqX7Up0X"},"game":{"id":{"objectId":"Zspd2nNHfz"}}},{"id":"yP3EHAZrDC","date":"2019-04-12T18:20:03.604Z","rating":4,"title":"First play...","description":"First play was great fun.\nWhat an experience.\nPerhaps found a game that has quick setup and can be enjoyed by Lauraine and me.\nHappy days.\n\nReplayability could become an issue, but this sounds like a complaint similar to the first game, but without the scenario setup and dungeon master requirements.\nStill, a jolly good romp when played, with each scenario quite different.  The final or lengthiest scenario being one of the more story driven too.\n\nUpdate 1\/9\/2018 - just played scenario 16 Altered Fates.  Its been a while since we had played this and it was nice to get it out again. Bloody hell some of the puzzles are getting harder to do or am i just getting older.  Well without any spoilers, it could have well been the latter. Gloria Goldberg & Jenny Barnes managed to just about hold their own.\n\npainting notes\nkorne red base colour on outer robes\npink horror on hood \nkindleflame dry brush robes\n1 parts nulin \/ 2 part casandora yellow all over clothes  robe\nfire dragon bright on hood","user":{"username":"Robertcompton","id":"Z2vesScdom"},"game":{"id":{"objectId":"Zspd2nNHfz"}}}]