[{"id":"evaskTGfpj","date":"2020-07-26T12:52:32.894Z","rating":5,"description":"Great and well designed game.  My family loves it and no two games are ever the same.","user":{"username":"WadeB1977","id":"HZhD1d3cMU"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"ZEQckBfhYx","date":"2020-05-25T12:05:19.817Z","rating":4,"title":"A beautiful easy to play game","description":"Much as it has stirred controversy for being over-hyped. Wingspan is in my opinion one of the most elegantly designed games I have come across. It is a dream to team as so much of the game is presented in bite size chunks on the cards that you really only have to teach about 4 rules. It is a nice lightweight, minimal interaction engine builder and the art work and components are gorgeous.","user":{"username":"Courageous Bob","id":"vYQtEV9o0A"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"0jrpg7ojkt","date":"2020-05-14T15:16:24.439Z","rating":5,"title":"This game ...","description":"This game is mad dank. Our most played game for sure","user":{"username":"verysmallbeta","id":"F3J8EiTAzC"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"6SXyTq6B81","date":"2020-04-14T20:23:38.220Z","rating":4,"title":"A family a...","description":"A family and non-gaming group favorite. Beautiful game and components and full of great (even if sometimes meaningless) decisions.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"whtLi0MMME","date":"2020-04-14T20:23:38.029Z","rating":4,"title":"A family a...","description":"A family and non-gaming group favorite. Beautiful game and components and full of great (even if sometimes meaningless) decisions.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"zl4jDnWLUQ","date":"2020-04-14T19:39:06.500Z","rating":5,"title":"Delightfully refined","description":"Smooth, gorgeous, clever, and adored by my family.  Wonderfully interconnected design makes for satisfying bird-engines that are easy for new players to jump into, and still engaging for experienced veterans trying new things.  A lovely example of visual and mechanical design combining as they should to make an excellent end product.","user":{"username":"Wyrd","id":"SYE77fvfyX"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"yyp4uvtQ2v","date":"2020-04-01T19:01:16.761Z","rating":3,"title":"While I'd ...","description":"While I'd argue Wingspan isn't a thematic game mechanically, I've never played something that benefits from production detail and visuals as much as Wingspan. Somehow these birds have warmed my cold, dead, Euro heart.Unfortunately for me, Wingspan is built on foundational mechanics that are luck heavy. I often find myself frustrated with the engine I've built because of how singularly tactical and luck dependant your situation CAN feel. Wingspan also lacks meaningful player interaction, and runs long for it's complexity level.When Wingspan gels, the game is fun, the decisions are crunchy, and the combos are satisfying.","user":{"username":"Bryle","id":"lLhNFG8GGJ"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"vsezYAj0WF","date":"2020-04-01T18:34:34.273Z","rating":3,"title":"Good game,...","description":"Good game, with an underutilized theme. Gameplay goes well with the theme and there are even biological facts included on each bird card. Many of the bird effects are thematically tied to their biological facts as well which is a nice touch. I think a couple of particular area needs improvement\/tweaking. End game resulted in 3 of the 4 of us just going for eggs with final few actions. No real incentive to go for birds (unless there is one for a high VP value), food, or cards so the end game felt rather railroady for most of us (one player pursued his extra hidden goal cards instead of going for eggs). Otherwise, it was a really enjoyable experience.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"HPlfPiSJCJ","date":"2020-04-01T02:54:24.212Z","rating":2,"title":"This one w...","description":"This one was alright. We played it with 4, I enjoyed the fact that each of the cards is completely unique with regards to the bird contained on the cards.  Light Engine Builder that was easy to teach\/learn.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"u0farvZHko","date":"2020-03-24T18:56:32.492Z","rating":3,"title":"Love the t...","description":"Love the theme, components and artwork. Really nice, streamlined rules with meaningful decisions to take during gameplay. I would say it's even a relaxing game.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"T7uMwcJeMb","date":"2020-03-18T01:49:34.880Z","rating":4,"title":"Weight: 2....","description":"Weight: 2.37 \/ 5","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"gAt4k8w8dm","date":"2020-03-18T00:44:38.913Z","rating":4,"title":"New Stonem...","description":"New Stonemeier Game with a cool theme: Birds!","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"dYoxQKFB2G","date":"2020-03-07T03:12:43.591Z","rating":4,"title":"1-5","description":"1-5","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"f03aAXt97T","date":"2020-03-05T15:09:11.649Z","rating":4,"title":"I got luck...","description":"I got lucky and got a copy of one the first shipments. It is a really good game, but not worth $90-$100 I've seen from price gougers. Art is beautiful. Game play is simple, but with meaningful choices. This is one where I think the theme was looked over (who wants to play a bird game), but once you play it you really appreciate how the cards, components, and game play all comes together.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"lqlmYGQjsS","date":"2020-03-02T19:55:12.150Z","rating":4,"title":"What a fan...","description":"What a fantastic game! Like Viticulture, the theme does little for me (more than wine though), but the game is great and beautiful!","user":{"username":"RyanLopez","id":"s1SvjLpi66"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"HPuvPuFioL","date":"2020-02-03T17:40:42.600Z","rating":5,"title":"Great Game, just above gateway but not too intimidating!","description":"Great game, great art, interesting theme, great first game by an up and coming designer. Excellent production!","user":{"username":"WineScar","id":"31makDwKZA"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"9EuotAhKnG","date":"2020-01-28T20:36:05.923Z","rating":4,"title":"Only one p...","description":"Only one play so far, I think the rating will likely go up after a few more.","user":{"username":"JohnTaylor","id":"EPNHNHSPfg"},"game":{"id":{"objectId":"5H5JS0KLzK"}}},{"id":"d7UTvKSDma","date":"2020-01-26T03:53:59.915Z","rating":2,"title":"Precisely ...","description":"Precisely what you would expect from a Stonemaier tableau builder--next to zero player interaction, scoring that is unfocused, rather high degree of variance, and extremely pretty. The theme is incoherent, to the point of absurdity, so pretty much all you have are awesome bird drawings.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"5H5JS0KLzK"}}}]