[{"id":"GEJv45lTkk","date":"2020-04-12T13:36:56.921Z","rating":4,"title":"This is ou...","description":"This is our “saga” game. 3 hours of narrative story game as the empire hunts out the rebels. Expansive for the empire as the fleet grows and the tide of armies stretches across the universe. Tense for the rebel’s as the board gets more and more oppressive.The expansion does improve this game.Ok with 3 or 4 in team play, but probably a better two player game when all things considered. The team play does mean my two sons can play against me. Which holds their interest longer and gives them more confidence.","user":{"username":"NeilGordon","id":"Ahchq6lnef"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"ahVTAR8GuO","date":"2020-04-12T13:36:56.882Z","rating":4,"title":"This is ou...","description":"This is our “saga” game. 3 hours of narrative story game as the empire hunts out the rebels. Expansive for the empire as the fleet grows and the tide of armies stretches across the universe. Tense for the rebel’s as the board gets more and more oppressive.The expansion does improve this game.Ok with 3 or 4 in team play, but probably a better two player game when all things considered. The team play does mean my two sons can play against me. Which holds their interest longer and gives them more confidence.","user":{"username":"NeilGordon","id":"Ahchq6lnef"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"Ij1Ekh75QJ","date":"2020-04-01T19:00:51.071Z","rating":3,"title":"Star Wars:...","description":"Star Wars: Rebellion is an incredibly thematic and engaging game. I can see why those who love Star Wars and American style games would absolutely love this. Rebellion does explosive moments of triumph and defeat better than 95% of games on the market. I lean closer to enjoying games with minor elements of luck. Unfortunately for me, Rebellion has dice combat, a lot of random card drawing, and unpredictable opponent play. One of Rebellion's biggest draws is how impressively the board game mirrors the original trilogy. The Rebels get constantly beaten down until mid-way through the game. Then an underdog tale develops. While I appreciate how Rebellion consistently matches the bigger Star Wars picture, as a Rebel player I just don't enjoy myself during that brutal first half.Additionally I have qualms with the difficulty of grasping the game. I'm someone quite familiar with rule heavy strategic games. Learning Star Wars: Rebellion was far more challenging than it should have been. There are too many edge cases and fiddly rules that I believe could have been streamlined out. Those jankey rules bog down the experience and add to a playtime that's far, FAR too long.","user":{"username":"Bryle","id":"lLhNFG8GGJ"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"yI73hoa87g","date":"2020-03-24T18:56:16.282Z","rating":4,"title":"Really lik...","description":"Really like the replayability of this game. The fact that you can choose the Empire or the Rebel Alliance to play and have totally different strategies to win according to wich side you're on is really cool. The miniatures are really good, quality plastic. This game is for people who love strategy. It is not fast paced and requires some thinking and the turns take some time. Also there is the possibility of not having enough miniatures to play if you are conquering a lot of systems.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"PBUf2w9wK0","date":"2020-03-18T00:43:45.164Z","rating":5,"title":"2 players ...","description":"2 players only. 120-180 minutes, Star Wars in a box!Rating based on a solo run through and two games, once with my son and once with a friend. VERY cool game and very thematic. Once you have played a few rounds, it plays rather intuitive. Given the length (3 hours easily) and only 2p, it won't hit the table much, but still very happy that this one is in my collection.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"CS78ipucNE","date":"2020-03-07T03:12:25.311Z","rating":4,"title":"2-4","description":"2-4","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"BD5BepvusY","date":"2020-03-05T15:09:06.330Z","rating":4,"title":"I've only ...","description":"I've only played twice, once as the Empire and once as the Rebels. I enjoyed both plays. Each game was probably 2.5 to 3 hours long (maybe longer), but it didn't feel like it was that long as you are constantly engaged. Great feeling being the Empire, as you grow and grow, but I felt anxious just about the whole time as the Rebels. This is an outstanding game IMO.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"LqSw22X1ow","date":"2020-03-02T19:55:00.083Z","rating":4,"title":"Time inves...","description":"Time investment alone keeps this from being a perfect 10 for me. What an amazing game.","user":{"username":"RyanLopez","id":"s1SvjLpi66"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}},{"id":"XeCMd4L3OB","date":"2020-02-28T01:36:36.644Z","rating":4,"title":"DUDE.. its...","description":"DUDE.. its head to head 2 player STAR WARS by Fantasy Flight. 'Nuff said.","user":{"username":"BGillz81","id":"wxvBXzSKgJ"},"game":{"id":{"objectId":"Qq2rPNOpoO"}}}]