[{"id":"6v6XhX0aTo","date":"2020-04-01T02:39:05.980Z","rating":3,"title":"Interestin...","description":"Interesting game.  Very similar in Theme and Mechanics to Lords of Waterdeep, however, this game is better in every way.  Because it's more fun than Lords of Waterdeep.Now, that being said, those extra victory conditions might be really powerful.  Needs more plays for me to figure out if this actually has multiple paths to victory, or if it's just who gets the most extra victory points from the lore path.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"EYbnvWUN7H","date":"2020-03-05T15:08:27.617Z","rating":4,"title":"Have only ...","description":"Have only played it once and I got smoked in the point scoring. I really enjoyed it, I like rolling the dice to beat the monsters, trolls, etc. . .I felt like; in about round 5, there were 2 runaway potential winners. I knew I was basically playing for 4th or 5th. So, at the end of the game, I went to fight the troll just to place the blame token on the 1st place player. I need more play before I say anything about balance. Maybe I just suck? But, knowing I had no real chance of winning for 3 rounds kinda stinks. Again, liked the game and would def play it again.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"XHFqBSu1qb","date":"2020-03-03T19:13:24.990Z","rating":3,"title":"Full game ...","description":"Full game housed in Kickstarter exclusive box from expansions campaign","user":{"username":"DiggingDice","id":"LdQWFOWDSY"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"EALJwGMVJk","date":"2020-02-05T16:03:11.614Z","rating":4,"title":"I never th...","description":"I never thought I'd care for Viking games, but Champions of Midgard is so satisfying. Build your cadre of warriors, then send them off into battle. Roll your dice, kill the Trolls, slaughter the Draugrs, defeat the Monsters, and try not to get sucked into a whirlwind. Even without the expansion, this is a worker placement game that is as exciting as it needs to be. Love it.","user":{"username":"BackBurnerGames","id":"bLRwfwEKuF"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"5seGCPDF9l","date":"2020-01-28T06:03:45.945Z","rating":4,"title":"Greeeeat W...","description":"Greeeeat WP game, needs variety in the monsters and more special dice, that seems to be solved in the upcoming expansions.\n\nEdit: Yes, the variety was solved with the expansion, and the Valhalla lets you take more risk and you can acomplish more things","user":{"username":"Abulense","id":"DttwlhgAYM"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"Pi9nn5Md7C","date":"2020-01-26T03:23:12.010Z","rating":2,"title":"A tolerabl...","description":"A tolerable and pedestrian worker-placement game, except...\nA game this tepid doesn't deserve so much passion, but allow me to vent some spleen here. This game has two massive problems.\nFirst and foremost, the kingmaking potential and arbitrary nature of the grotesquely stupid \"choose a player to lose points\" nonsense is beyond bad. It seems like a ham-handed attempt at introducing player interaction, but it's so clumsy and gratuitous that it helps change a forgettable one into an irritating one.\nSecond, and this is more personal, this has to be one of the worst examples of a wasted theme in a long time. I mean, come on--Norse mythology allows you to do so much. Where are the gods, the fatalism, the end of the world, the big name monsters? The only famous monster referenced is via a strange \"Fenris Cub\" monster type.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"eHU4FFYlD0","date":"2020-01-25T05:54:30.362Z","rating":4,"title":"[b][size=1...","description":"[b][size=12][BGCOLOR=#C0C0C0]Sleeved[\/BGCOLOR][\/size][\/b]\n","user":{"username":"kentdavies","id":"LiAt0DjAeB"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"2tc6uplFes","date":"2020-01-20T18:05:13.061Z","rating":4,"title":"Kickstarte...","description":"Kickstarter Project http:\/\/kck.st\/1QOfHqT\n- Backed: 06\/26\/2015\n- Funded: 07\/20\/2015\n- Pledge Level: Pledge $30 or more: \"The Investigator - This gets you the game plus all stretch goals, updates and our undying gratitude for supporting our project.\nShipping is free in the U.S, $8 to Canada and only $15 to anywhere else in the world!\"\n- Payment: $30\n- Survey: 08\/06\/2015 crowdox\n- Projected Delivery: 12\/2015\n- Shipped: \n\n\nStatus: DELIVERED","user":{"username":"javajoe96","id":"TVSY9G5uFc"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"sgiUZ6tDCp","date":"2019-12-20T19:22:31.527Z","rating":4,"title":"Very enjoy...","description":"Very enjoyable thematic worker placement game with dice chucking. With expansions this jumps to a 9, will never play without them now.","user":{"username":"poypoyking","id":"1ANb7tY2Cm"},"game":{"id":{"objectId":"zBikUpC51l"}}}]