[{"id":"6v6XhX0aTo","date":"2020-04-01T02:39:05.980Z","rating":3,"title":"Interestin...","description":"Interesting game.  Very similar in Theme and Mechanics to Lords of Waterdeep, however, this game is better in every way.  Because it's more fun than Lords of Waterdeep.Now, that being said, those extra victory conditions might be really powerful.  Needs more plays for me to figure out if this actually has multiple paths to victory, or if it's just who gets the most extra victory points from the lore path.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"EYbnvWUN7H","date":"2020-03-05T15:08:27.617Z","rating":4,"title":"Have only ...","description":"Have only played it once and I got smoked in the point scoring. I really enjoyed it, I like rolling the dice to beat the monsters, trolls, etc. . .I felt like; in about round 5, there were 2 runaway potential winners. I knew I was basically playing for 4th or 5th. So, at the end of the game, I went to fight the troll just to place the blame token on the 1st place player. I need more play before I say anything about balance. Maybe I just suck? But, knowing I had no real chance of winning for 3 rounds kinda stinks. Again, liked the game and would def play it again.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"XHFqBSu1qb","date":"2020-03-03T19:13:24.990Z","rating":3,"title":"Full game ...","description":"Full game housed in Kickstarter exclusive box from expansions campaign","user":{"username":"DiggingDice","id":"LdQWFOWDSY"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"EALJwGMVJk","date":"2020-02-05T16:03:11.614Z","rating":4,"title":"I never th...","description":"I never thought I'd care for Viking games, but Champions of Midgard is so satisfying. Build your cadre of warriors, then send them off into battle. Roll your dice, kill the Trolls, slaughter the Draugrs, defeat the Monsters, and try not to get sucked into a whirlwind. Even without the expansion, this is a worker placement game that is as exciting as it needs to be. Love it.","user":{"username":"BackBurnerGames","id":"bLRwfwEKuF"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"5seGCPDF9l","date":"2020-01-28T06:03:45.945Z","rating":4,"title":"Greeeeat W...","description":"Greeeeat WP game, needs variety in the monsters and more special dice, that seems to be solved in the upcoming expansions.\n\nEdit: Yes, the variety was solved with the expansion, and the Valhalla lets you take more risk and you can acomplish more things","user":{"username":"Abulense","id":"DttwlhgAYM"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"Pi9nn5Md7C","date":"2020-01-26T03:23:12.010Z","rating":2,"title":"A tolerabl...","description":"A tolerable and pedestrian worker-placement game, except...\nA game this tepid doesn't deserve so much passion, but allow me to vent some spleen here. This game has two massive problems.\nFirst and foremost, the kingmaking potential and arbitrary nature of the grotesquely stupid \"choose a player to lose points\" nonsense is beyond bad. It seems like a ham-handed attempt at introducing player interaction, but it's so clumsy and gratuitous that it helps change a forgettable one into an irritating one.\nSecond, and this is more personal, this has to be one of the worst examples of a wasted theme in a long time. I mean, come on--Norse mythology allows you to do so much. Where are the gods, the fatalism, the end of the world, the big name monsters? The only famous monster referenced is via a strange \"Fenris Cub\" monster type.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"eHU4FFYlD0","date":"2020-01-25T05:54:30.362Z","rating":4,"title":"[b][size=1...","description":"[b][size=12][BGCOLOR=#C0C0C0]Sleeved[\/BGCOLOR][\/size][\/b]\n","user":{"username":"kentdavies","id":"LiAt0DjAeB"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"2tc6uplFes","date":"2020-01-20T18:05:13.061Z","rating":4,"title":"Kickstarte...","description":"Kickstarter Project http:\/\/kck.st\/1QOfHqT\n- Backed: 06\/26\/2015\n- Funded: 07\/20\/2015\n- Pledge Level: Pledge $30 or more: \"The Investigator - This gets you the game plus all stretch goals, updates and our undying gratitude for supporting our project.\nShipping is free in the U.S, $8 to Canada and only $15 to anywhere else in the world!\"\n- Payment: $30\n- Survey: 08\/06\/2015 crowdox\n- Projected Delivery: 12\/2015\n- Shipped: \n\n\nStatus: DELIVERED","user":{"username":"javajoe96","id":"TVSY9G5uFc"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"sgiUZ6tDCp","date":"2019-12-20T19:22:31.527Z","rating":4,"title":"Very enjoy...","description":"Very enjoyable thematic worker placement game with dice chucking. With expansions this jumps to a 9, will never play without them now.","user":{"username":"poypoyking","id":"1ANb7tY2Cm"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"JCAAW4em7n","date":"2019-12-05T20:31:28.698Z","rating":4,"title":"Very good ...","description":"Very good Viking themed euro. A little heavy on the point salad for me and I didn't really see much engine building here - more tactical round-to-round decisions than grand strategy.\n\nThat being said, it was FUN. The Norse theme really shines through and I really liked the dice combat system - it reminds me much of the combat system used in Villainous Vikings (which is awesome in my unbiased opinion.)","user":{"username":"jerdude","id":"QfiJiogW5s"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"0qBDUANZuS","date":"2019-12-03T19:33:41.879Z","rating":4,"title":"This is on...","description":"This is one of the few games that I really don't mind the dice rolling mechanics. The game is basically eight rounds where you take turns placing workers to collect money, resources, vikings, and power up cards followed by using those vikings and resources to go out and clobber some monsters. The board is tight as far as spaces go and that leads to a pretty competitive game. There is lots of choices to be made all the time as well as lots of opportunities to just screw someone else over.","user":{"username":"rarroyo","id":"76P6FtbgDC"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"Nlk3plbYwD","date":"2019-12-03T02:31:41.544Z","rating":3,"title":"Very simpl...","description":"Very simple and easy to learn. The iconography is very much on point and makes it simple for people to pick up.\n\nWould be my introduction game into worker placement for new players. Not sure how much replayability there is but with expansions this could have a lot of staying power.","user":{"username":"Neeber","id":"x6rwCIMQBa"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"O66B0xLESE","date":"2019-10-25T19:39:05.246Z","rating":4,"title":"Vikings go...","description":"Vikings going into battle for glory. Great theme for a worker placement with dice rolling. Nice to see dice rolling games have mitigation for bad dice rolls.\n\nBumped up after including expansions.\n\nINCLUDED:\nChampions of Midgard: Valhalla\nChampions of Midgard: The Dark Mountains","user":{"username":"ccmonter","id":"sJFzVKgdg1"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"Z5YfzVcOI3","date":"2019-10-24T17:41:33.520Z","rating":5,"title":"No Review Title","description":"No Review Description","user":{"username":"Metalx35","id":"NEf2cAm8G2"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"hbuT3TeAun","date":"2019-09-25T15:29:06.463Z","rating":4,"title":"I don't kn...","description":"I don't know why it is about this game, but every time I play I get sucked in to the gameplay. Wonderful theme and despite the dice chucking, the battles are always exillerating.","user":{"username":"BenjaminK","id":"6tz3o3eKSP"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"WzifvgIuPa","date":"2019-06-19T20:10:50.521Z","rating":4,"title":"A very sol...","description":"A very solid worker placement game. It is easy enough to tech to a relatively new gamer yet has plenty of choices to satisfy a more experienced player. The Valhalla Expansion adds a ton to the game without over complicating things and can be easily included in a teaching session.","user":{"username":"BradAlmighty","id":"fAvGuslcco"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"UxTMViMBeo","date":"2019-06-15T06:00:37.867Z","rating":2,"title":"I'm truly ...","description":"I'm truly shocked that people compare this to Lords of Waterdeep.  Lords of Waterdeep is a far superior game and a true euro (though lightweight).  This is Ameritrash all the way.  Way too much dice chucking and random\/lucky effects.  I suppose it does feel a lot like somebody took the basic idea of Lords of Waterdeep, then removed the engaging quest elements and card play, added a bunch of dice\/luck and vikings and called it a game.  If LoW didn't exist, I might play this again, but since it does I don't think I ever would have a reason to.","user":{"username":"ComtriS","id":"0OeOcImoXw"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"pgGLLGdBao","date":"2019-06-15T05:41:41.745Z","rating":4,"title":"7.6 \/ 2-4p...","description":"7.6 \/ 2-4p Best 4 \/ 60-90min \/ Strategy 174 \/ 2.54","user":{"username":"JayferX","id":"OftL22qFK2"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"F2PfMDBxto","date":"2019-03-06T19:15:12.177Z","rating":3,"title":"Has elemen...","description":"Has elements that remind me of Mission Red Planet, Clank!, and Viticulture.  The art is cartooney but well done.  The theme is relatively strong for a eurogame.","user":{"username":"Fly Casual","id":"ByUwX0aA30"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"tqiqDO6yuz","date":"2019-01-22T04:32:11.916Z","rating":3,"title":"donation t...","description":"donation to library","user":{"username":"thingamarob","id":"fE012I3zwD"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"sOAhEzeCqE","date":"2019-01-19T21:32:33.898Z","rating":4,"title":"An incredi...","description":"An incredibly enjoyable worker-placement game with a nice push your luck mechanic. This is probably my new go-to gateway game for new board game players.","user":{"username":"GorditaCrunch93","id":"cIFDjaqNKT"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"JGaS2tqc2z","date":"2019-01-15T05:07:00.038Z","rating":4,"title":"An awesome...","description":"An awesome worker placement that's fairly light, which works well with the dice rolling combat. The theme is excellent, and all of the action spaces are fun to use. However this drops half a point because it is kind of weak at 2 players, its definitely best at 3-4. Feels like it could really use a good expansion!","user":{"username":"ubRtstcl","id":"uIyGcQjrvL"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"enODlgylbP","date":"2019-01-10T18:53:55.569Z","rating":4,"title":"Looks like...","description":"Looks like this one is replacing Lords of Waterdeep for a lot of others. I think they both have room in a collection, so I might looking at getting this one soon. I like the theme better and the dice rolling is always fun.\nWe have a member in our game group that has a copy, so I'm in no rush to get it.","user":{"username":"KimchiTurtle","id":"SpWSGAV6fl"},"game":{"id":{"objectId":"zBikUpC51l"}}},{"id":"peUf3rpfEV","date":"2019-01-10T14:09:32.572Z","rating":4,"title":"8.5 with t...","description":"8.5 with the expansion","user":{"username":"berboard","id":"Z5KmJADD9P"},"game":{"id":{"objectId":"zBikUpC51l"}}}]