[{"id":"aaIacHI1DM","date":"2020-04-01T18:23:50.746Z","rating":3,"title":"Minecraft:...","description":"Minecraft: The Board Game. After one play, I can say that I like it better than Agricola, but that may just be because I've played Agricola so much that's it's getting stale. I like how this one adds a couple of interesting side games (forging weapons and expeditions as well as the \"cavern\" side of the player board to develop). The scoring is improved in that there are fewer negatives, so one doesn't have to focus so much on \"a little of everything\", (although that still seems to be a viable way to win). Another excellent Uwe Rosenberg game with wonderful components (although severely overproduced) and excellent scalability for different numbers of players. Why did they not include a player aid that covers end-game scoring?!I don't think it's worth owning, given that I've already got Agricola with the Farmer's of the Moor expansion. This is very close to the same game as those two, and I feel that it would get stale after a few more plays just as Agricola did. Update: Now, 3 plays in (all 2-player), and I think it's as fun as Agricola. I traded for it, and I still own Agricola plus FotM. I'd like to play it with more players, but I fear that it would drag too long at the upper end with inexperienced players.Update 2: I'm trading it away. After a few years, I don't enjoy it as much as I did. Even playing with new players, it seems the same buildings are often sought after, making for a less interesting experience. I'm losing interest in games with so many bits without the payoff. The animal husbandry rules are clunky. I'll probably even get rid of Agricola, even though I'd still play either of these. But, I probably won't suggest.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"PRtNLK8q0C","date":"2020-04-01T02:38:52.790Z","rating":1,"title":"I agree th...","description":"I agree that this game is a more streamlined remake of Agricola, which addresses some people's concerns with Agricola.  But honestly, I don't think it's any better, and in fact is a lot worse. It hits you a little harder with the buildings than Agricola does.  Since you are competing with everyone in a big pool for what's available, so the paralysis of what to do with regards to buildings is much much higher.You could technically do the same thing in Agricola with the Occupations\/improvements.  Well most of them anyway.I think Caverna might handle higher player counts a tad better than Agricola, but they are both going to be long games with lots of players.  I think I'm still in the 2 or 3 player only tree on both of the games, just for time reasons.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"Sh00ocFgj3","date":"2020-03-18T01:44:44.578Z","rating":4,"title":"Weight: 3....","description":"Weight: 3.79 \/ 5Includes broken token wooden insert","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"0DAMHQym7H"}}}]