[{"id":"IFUKL5fdbI","date":"2020-08-05T15:19:35.890Z","rating":4,"description":"I like Caverna in most aspects - the dwarf theme, the worker placement, etc. It feels a little too loose at times, but is still a wonderful game. It is inferior to Agricola.","user":{"username":"povertidonki","id":"eqPHRjtz0E"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"f3wNtxXPcE","date":"2020-07-28T19:01:06.243Z","rating":4,"description":"Great game, we just can't get it played.","user":{"username":"JordanPlaysBlue","id":"K9tHM9bwRQ"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"aaIacHI1DM","date":"2020-04-01T18:23:50.746Z","rating":3,"title":"Minecraft:...","description":"Minecraft: The Board Game. After one play, I can say that I like it better than Agricola, but that may just be because I've played Agricola so much that's it's getting stale. I like how this one adds a couple of interesting side games (forging weapons and expeditions as well as the \"cavern\" side of the player board to develop). The scoring is improved in that there are fewer negatives, so one doesn't have to focus so much on \"a little of everything\", (although that still seems to be a viable way to win). Another excellent Uwe Rosenberg game with wonderful components (although severely overproduced) and excellent scalability for different numbers of players. Why did they not include a player aid that covers end-game scoring?!I don't think it's worth owning, given that I've already got Agricola with the Farmer's of the Moor expansion. This is very close to the same game as those two, and I feel that it would get stale after a few more plays just as Agricola did. Update: Now, 3 plays in (all 2-player), and I think it's as fun as Agricola. I traded for it, and I still own Agricola plus FotM. I'd like to play it with more players, but I fear that it would drag too long at the upper end with inexperienced players.Update 2: I'm trading it away. After a few years, I don't enjoy it as much as I did. Even playing with new players, it seems the same buildings are often sought after, making for a less interesting experience. I'm losing interest in games with so many bits without the payoff. The animal husbandry rules are clunky. I'll probably even get rid of Agricola, even though I'd still play either of these. But, I probably won't suggest.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"PRtNLK8q0C","date":"2020-04-01T02:38:52.790Z","rating":1,"title":"I agree th...","description":"I agree that this game is a more streamlined remake of Agricola, which addresses some people's concerns with Agricola.  But honestly, I don't think it's any better, and in fact is a lot worse. It hits you a little harder with the buildings than Agricola does.  Since you are competing with everyone in a big pool for what's available, so the paralysis of what to do with regards to buildings is much much higher.You could technically do the same thing in Agricola with the Occupations\/improvements.  Well most of them anyway.I think Caverna might handle higher player counts a tad better than Agricola, but they are both going to be long games with lots of players.  I think I'm still in the 2 or 3 player only tree on both of the games, just for time reasons.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"Sh00ocFgj3","date":"2020-03-18T01:44:44.578Z","rating":4,"title":"Weight: 3....","description":"Weight: 3.79 \/ 5Includes broken token wooden insert","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"345wqsfHfI","date":"2020-03-18T00:18:14.438Z","rating":4,"title":"1-7 player...","description":"1-7 players, c. 30 minutes per player, medium heavy, worker placementHad a first go today and had a lot of fun exploring this game. Feels very much like its predecessor Agricola, but smoother. Like the theme, like the adventuring and the wide range of options to choose from. Want to play again, to further explore the game!","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"E9DeQtA1p2","date":"2020-03-07T03:11:47.170Z","rating":4,"title":"1-7","description":"1-7","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"uMQHsewJiA","date":"2020-02-02T10:03:29.636Z","rating":3,"title":"Had a horr...","description":"Had a horrible rules explanation on a four player game with 3 players new to the game. I can see the appeal but it appears a little too static in the open.","user":{"username":"Bazooka13","id":"UzHJdjLCjG"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"UjSEUoNYJ0","date":"2020-01-26T19:04:40.304Z","rating":4,"title":"Another fi...","description":"Another fine Uwe game.  Haven't met one I didn't like yet.","user":{"username":"ab999","id":"uIetiCqrHE"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"qGOhPbzKnQ","date":"2020-01-26T03:22:55.048Z","rating":3,"title":"I'm not su...","description":"I'm not sure I see a reason to prefer this to Agricola. It's smoother in a lot of ways, to be sure, but between the slew of special buildings available at the outset (Caverna) and the cards (Agricola) I think I prefer the cards. They throttle information and choice, so as to prevent overload, and they also give a reason to pursue different approaches each game. Caverna already feels too samey. The flexibility afforded by rubies and expeditions are nice, but that might make them too dominant.\nIt's a great game, to be sure--but not as great as its forebear.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"lwkVDoR7Lp","date":"2020-01-25T07:10:59.167Z","rating":4,"title":"Expansions...","description":"Expansions:\n- The Forgotten Folk\n\nVery similar to Agricola, but rather than being focused on the family + farming situation, there's a lot more to do. You can send your dwarves on adventures as well as mine out a cave.\n\nI think I prefer Agricola a little more than this one, but they both have a spot in my collection as they both provide a fairly different experience.\n\nI'm still puzzled why they included 7 players worth of materials in the box because I don't know anybody who would ever try to play this game 7 players. First of all - who owns a table that big? Second of all - it'd take forever to play.","user":{"username":"GossamerSolid","id":"IwHp4RNkLJ"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"JW9j27BGxM","date":"2020-01-25T03:04:03.284Z","rating":3,"title":"3\nxx","description":"3\nxx","user":{"username":"Arcshot","id":"Xpnrl5RFHA"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"MCZZvIVme8","date":"2020-01-25T00:22:36.140Z","rating":4,"title":"This game ...","description":"This game is Agricola with a bit more going on. You get to do more, which feels good. You also have to do more, so if you have a bad start you can really feel up against the wall.","user":{"username":"warder57","id":"iaobIrOTQm"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"tUEA1MdlPP","date":"2020-01-03T22:37:06.489Z","rating":3,"title":"I'll be he...","description":"I'll be hesitant to play with five again, very unlikely to play with six or seven at all.\nThe obvious comparisons to Agricola are present but (after a single game) I much prefer Agricola as the increased choices of action here make thinking about what's worthwhile harder. Leading to much more AP.","user":{"username":"Avron","id":"rZRAVFlqOc"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"OGP9BkXUjM","date":"2019-12-24T18:27:34.790Z","rating":3,"title":"Caverna fe...","description":"Caverna feels very similar to Agricola.  I like it a little better because the sense of progression is strongest in Caverna.  Simultaneously I like it a little less as I felt the rich amount of cards available in Agricola was better than the set # of tiles offered in Caverna.","user":{"username":"Kevin_Whitmore","id":"RwDgAMwMJY"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"IYuqs8AvHL","date":"2019-12-20T22:24:03.877Z","rating":3,"title":"More fun t...","description":"More fun than Agricola, though I could see it being not as replayable.","user":{"username":"AndyMesa","id":"dW0VtNrQ1u"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"zJn1KCasAh","date":"2019-12-14T17:34:07.418Z","rating":4,"title":"July 2019\n...","description":"July 2019\n$51","user":{"username":"Wolfbearheart","id":"h5ZExFcIac"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"BvISYY13t5","date":"2019-12-11T23:31:55.781Z","rating":3,"title":"SO much be...","description":"SO much better than Agricola (aka Misery Farm)","user":{"username":"void_presence","id":"wU5CXExePh"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"we3Hs0JKFs","date":"2019-12-11T22:35:08.448Z","rating":4,"title":"Doesn't qu...","description":"Doesn't quite justify its table presence as well as AFFO, but Caverna is very solid.","user":{"username":"JoeAubrey","id":"xpjKPMmCF1"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"zmlZ2vFj9v","date":"2019-12-05T20:31:28.480Z","rating":4,"title":"Very cool ...","description":"Very cool game. Heavy, point-salad style worker placement. Impossible to put together a strategy until you study the available tiles or play a few times. Still, lots of fun to be had.","user":{"username":"jerdude","id":"QfiJiogW5s"},"game":{"id":{"objectId":"0DAMHQym7H"}}},{"id":"pk5A59Zyul","date":"2019-10-29T07:07:26.989Z","rating":4,"title":"Owned by a...","description":"Owned by a friend, this is an excellent game with many paths to victory.","user":{"username":"3MBG","id":"Iq8eBovdNm"},"game":{"id":{"objectId":"0DAMHQym7H"}}}]