[{"id":"VzfVaezU9i","date":"2020-08-01T07:24:28.319Z","rating":5,"description":"I love it so much. It's just a really fun, easy, drafting game, and each of the expansions adds something different and fun. I would never play without at LEAST Leaders--and I'd always select which leaders to include and exclude, depending on the group, first. I'd play Armada with a group who were fairly well acquainted, but not all that well versed in board games more generally, and then finally Cities only for people who are OK with looking symbols up a lot--even though I think it might be the best expansion of the lot.","user":{"username":"Perchy","id":"XyM3iXdu83"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"zC9roTnlc4","date":"2020-07-24T05:20:42.049Z","rating":5,"description":"iOS, BGA","user":{"username":"sangwoko","id":"ASh49hEcAE"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"rx9PvqU31M","date":"2020-07-22T02:48:41.811Z","rating":5,"description":"This was my gateway game. Will always have a soft spot in my heart for this one. Love the intro to the drafting mechanic, and the expansions add enough to keep the game interesting and add complex decisions. Games never last an hour, so it's easy to replay and enjoy a new strategy each time depending on what you're seeing for cards. Art is weird, could have been a lot better, game quality is great for the time.","user":{"username":"thunderbault","id":"hfu8Z8NrCN"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"H5AuDq6o27","date":"2020-07-20T14:02:32.354Z","rating":4,"description":"Perfect for that next level game experience. Have 30 plus plays and still enjoy the base game. Not loads to chew on but plays so smoothly and always enjoyable.","user":{"username":"Jon Dante","id":"x2tLaqb9Tw"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"17WZwUaFUc","date":"2020-05-03T22:42:37.463Z","rating":4,"title":"At first, ...","description":"At first, the number of symbols was troublesome. But when you get used to them, it is ok. The idea to watch only your neighbor is very good, especially in six or seven players. This game is very good even when you play it with 7 other players.","user":{"username":"fzerorubigd","id":"2WmvkhpCwW"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"IjwNlDBD9y","date":"2020-03-24T18:05:01.250Z","rating":4,"title":"I would ma...","description":"I would make this a 10 myself as I'm always down to play it but it's difficult to get others to join in.","user":{"username":"Mythiqa","id":"W6hzE6pPMQ"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"pbP6b2er18","date":"2020-03-18T01:42:13.902Z","rating":1,"title":"Weight: 2....","description":"Weight: 2.34 \/ 5Traded for Survive: Escape from Atlantis.","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"kOZQZb30ZA","date":"2020-03-18T00:12:37.166Z","rating":4,"title":"Designer: ...","description":"Designer: Antoine Bauza (Takenoko, Tokaido, Hanabi, Oceanos).Publisher: Repos\/AsmodeePlayer count: 2-7 (best with 4)Weight: Light mediumMechanics: Card drafting \/ tableau buildingSetting\/theme: Civ buildingPlay time: 30-45 minutesFor my review, please refer to: https:\/\/boardgamegeek.com\/article\/21720247#21720247This is easily one of my favourite games.I've played a dozen games with 3-7 players and it is great fun everytime and with every player count. It seems rather complex at first, but it plays rather naturally after a few rounds.In its core this is a card drafting \/ tableau building  game over three phases, where you want to build up your resources at first to be able to build your own economy, military and science and if possible, you personal wonder. To do this, you choose one card to play and pass the other cards to your neighbour. When all the cards are played, then intermediate scoring takes place (on military power) and the next phase starts. After phase 3 the game ends and final scoring takes place.There are several paths that can lead to victory, but it's usually best to focus on one or two routes. Keeping a close eye on your neighbour is very important as you can benefit from his resources, goods and -especially in the last phase- from the cards he\/she has played.All in all, I really like this game. It plays rather fast, so you can play a number of games on a single night. I rate this game 9\/10 and would play this again anytime","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"HzD3ae7O8m","date":"2020-03-09T23:04:48.036Z","rating":4,"title":"\"A CIV gam...","description":"\"A CIV game for 7 players that is playable in 30 minutes! Even with multiple expansions, it could easily be played under 60 minutes. And so simple that even non-gamers can participate! Great fun!\"","user":{"username":"opticode","id":"GOBGDBMHVT"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"pvy6MiKtiR","date":"2020-03-09T15:00:43.123Z","rating":3,"title":"Good with ...","description":"Good with 5-7 people, everyone needs to be paying attention\/know whats going on","user":{"username":"bwoller","id":"UtOazeQEfx"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"nBYZgA6rr6","date":"2020-03-07T03:11:29.353Z","rating":4,"title":"2-7","description":"2-7","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"VECOHgBlhe","date":"2020-03-04T19:33:18.205Z","rating":4,"title":"quite impr...","description":"quite impressed after 2 plays.  very few games can support 6-7players, be this interesting and play in well under an hour.","user":{"username":"antiussentiment","id":"jqE5Gn3RFW"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"ECcay8rAmO","date":"2020-03-02T19:52:55.482Z","rating":4,"title":"Started tr...","description":"Started tracking games late. Add AT LEAST 10 to the number of plays.","user":{"username":"RyanLopez","id":"s1SvjLpi66"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"bCclhkCABC","date":"2020-02-28T22:50:53.060Z","rating":4,"title":"Excellent ...","description":"Excellent warm-up\/filler game for all groups.  My serious gaming friends are happy to play for a break between heavier stuff, but it is also good for my more casual group because it can be played on \"autopilot\" to some extent, allowing for easy socializing during play.  Easy to teach and learn.","user":{"username":"permagoof","id":"EE9k3rx1UU"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"3BMWFUDWkF","date":"2020-02-28T01:35:01.602Z","rating":4,"title":"Excellent ...","description":"Excellent card based economy game","user":{"username":"BGillz81","id":"wxvBXzSKgJ"},"game":{"id":{"objectId":"OF145SrX44"}}},{"id":"iaHRgNh79D","date":"2020-02-25T17:42:08.959Z","rating":3,"title":"Good distr...","description":"Good distraction for and hour or less. Quite easy to teach and get new people hooked (even non-gamers).","user":{"username":"paka","id":"rp47DWzo8q"},"game":{"id":{"objectId":"OF145SrX44"}}}]