[{"id":"ME8WFSBDD7","date":"2020-07-19T15:37:25.324Z","rating":5,"description":"Co-op \/ SoloFOFA Candidat","user":{"username":"Vucora","id":"Gd7ghgvUUq"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"NBXDZBQg49","date":"2020-07-19T10:53:03.885Z","rating":4,"description":"Reviewed","user":{"username":"thegiantbrain","id":"vSm1Ll3SCT"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"NvOZBOvM73","date":"2020-07-02T19:42:58.510Z","rating":5,"title":"Chicken Soup for the Cthulhian Soul","description":"It's easiest to just start out with the bad and get  it out of the way.\nCONS: Eldritch Horror is big, clunky, and fiddly. I've owned this game for years, and to the best of my memory I don't think I've ever played a game without referencing the rulebook at least once, if not repeatedly. It takes ages to set up and tear down. It takes several hours to play, so make sure you carve out a big chunk of your day before even trying. And lastly, I highly recommend buying the base game WITH the Forsaken Lore small-box expansion, which fleshes out the base game incredibly well.\n\nPROS: Just about everything else. If you want a big, meaty, hard Eldritch experience, this is an outstanding place to get it. Personally, I'm not much of a long-term planner. I love playing games by the seat of my pants and going with my gut instinct. With that in mind, I have lost this game more often than I've won. But losing has never felt cheap or lame or anticlimactic. It's a struggle from the very outset as the game can be very difficult. It punishes mistakes harshly, and can equally punish inaction. And sometimes it punishes you for no reason at all. But even when the game pushes you right over the edge and the world goes up in flames, you had one hell of a wild ride to get there. And then when you do win, when you sneak in that last game-winning fight before the seams of reality splinter, victory is that much sweeter.","user":{"username":"Crawley","id":"Mx1zTcgHOJ"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"0a2pfNy8TX","date":"2020-04-04T15:36:11.555Z","rating":4,"title":"EPIC and BRUTAL","description":"The second \"Modern Board Game\" i ever played . It is Fun and heartbreaking, i think ive only ever had the pleasure of defeating one of the old ones ONCE out of the ten times ive played it . Its like you and your friends are trying to plug holes in a leaking dam long enough for someone to come a pour new concrete to seal it up , except you keep falling down and breaking your arms and legs .","user":{"username":"Denomfug","id":"1LxSbLd0YD"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"czII5CBHxe","date":"2020-04-01T18:28:46.463Z","rating":3,"title":"The theme ...","description":"The theme just doesn't do anything for me, but this is certainly an improvement over it's predecessor, Arkham Horror.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"BUtaQ0ocfK","date":"2020-03-24T21:07:54.489Z","rating":2,"title":"I can't ge...","description":"I can't get myself to like games where the whole game depends on my one dice roll.","user":{"username":"joeaar","id":"pV9nLlKU68"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"anvUNKIm6I","date":"2020-03-05T15:08:46.215Z","rating":4,"title":"I've playe...","description":"I've played it 4-5 times now. Enjoy it a lot. I've won about 50% of the time. Always seem to win or lose on the last possible round, so it is climatic and I like that aspect.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"6w1NESFcHi","date":"2020-02-14T22:06:34.767Z","rating":3,"title":"Love the c...","description":"Love the co-op aspects and how thematic the game is. It's a long one, so it doesn't get on the table very often. Prefer with 2 players for balance reasons and mainly to keep it around 2 hours long.","user":{"username":"g6grim","id":"zukWhgG8u5"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"I6Ck0WuUrC","date":"2020-02-14T18:05:55.639Z","rating":1,"title":"No Review Title","description":"No Review Description","user":{"username":"Schmoop","id":"FPzEoqLkaB"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"FZIIkjE9DO","date":"2020-02-13T03:05:06.327Z","rating":3,"title":"I like thi...","description":"I like this game, but I really hate how it's FULL of flavor until you lose, then the game is just over with ZERO flavor.","user":{"username":"slimyhog","id":"U8aHIUYAdt"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"WXoTaD2CWG","date":"2020-02-12T06:51:05.477Z","rating":4,"title":"The most a...","description":"The most awesome of BGG Secret Santa gifts 2013!!!!!!","user":{"username":"Haikulture","id":"wAFb0Vtn4f"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"NxjDwejWb0","date":"2020-02-04T16:23:03.579Z","rating":4,"title":"The advent...","description":"The adventure\/horror game to get with some wonderful storytelling mechanics to it. I recommend this over Arkham Horror as it increases the scale of things happening across the globe & streamlines a lot of the Arkham Horror rules (on things like money for example) while keeping the importance on the story with the approaching doom.","user":{"username":"fox01313","id":"0fwkWT2y4p"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"c7HCX21fHJ","date":"2020-02-02T10:03:41.694Z","rating":3,"title":"Only playe...","description":"Only played solo. Would like to play with more to get a real feel\n\nNow that I have a determined second gamer I think this might be a good longer thematic game. I have almost re-bought it a few times.","user":{"username":"Bazooka13","id":"UzHJdjLCjG"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"xUUa3hjFQi","date":"2020-01-28T17:44:35.921Z","rating":3,"title":"\n","description":"\n","user":{"username":"ion514","id":"5m4MFdG580"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"HTXkeX5DjH","date":"2020-01-28T15:37:20.619Z","rating":2,"title":"Great them...","description":"Great theme, but the length of the game is just too much for it to be played frequently.","user":{"username":"Effervex","id":"oXk0xfkRr7"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"qDj9H5kg5c","date":"2020-01-28T06:04:02.430Z","rating":2,"title":"I love the...","description":"I love the theme and the adventure.But it's too long and heavy for my family. Solo was good but not great for the time invesment.\n\nA bunch of components and rules, like the train\/boat tickets, mythos phase and many kind of encounters bring theme to the table but also more randomness.\n\nMythos phase its like a set up for every round.\n\nAt the end feels like a giant puzzle more than an adventure to fight the ancient ones.\n\nWould pray to Cthulhu for see this system in a cleaner and quicker fashion.","user":{"username":"Abulense","id":"DttwlhgAYM"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"CYXCssUFXn","date":"2020-01-26T03:41:11.758Z","rating":3,"title":"Compared t...","description":"Compared to its progenitor, seems like a huge improvement thematically and in terms of gameplay as far as I'm concerned. It's also faster and less fiddly than Arkham Horror, which is not terribly difficult.\n[EDIT} For crying out loud, FFG, it's not that complicated--\"skip a turn\" (aka Delayed) elements have no place in a modern game. Why did you stuff in so many?","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"xJaojD4ww1","date":"2020-01-25T17:04:03.980Z","rating":4,"title":"3","description":"3","user":{"username":"Kamfer","id":"NCXK2RnuIv"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"WMNzOryMpG","date":"2020-01-25T07:11:09.435Z","rating":3,"title":"Expansions...","description":"Expansions:\n- Forsaken Lore\n\nSetup time is long on this one, but the game itself is very fun. Lots of replayability. You'll probably be re-reading the rules a lot during your first play.","user":{"username":"GossamerSolid","id":"IwHp4RNkLJ"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"WMijugfA5v","date":"2020-01-24T22:53:02.460Z","rating":4,"title":"1-8p\nSleev...","description":"1-8p\nSleeves\nPlano\nAll contents in Base\/Mountains boxes","user":{"username":"saxsoulo","id":"fjfQxfGyjw"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"LBpgtK8aHH","date":"2020-01-22T00:34:07.981Z","rating":4,"title":"Based on o...","description":"Based on one play, I really enjoyed this. Must revisit soon!","user":{"username":"Seamusk","id":"pHEXtCAFl5"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"eg6rFJKI9T","date":"2020-01-13T17:06:10.568Z","rating":4,"title":"Finally go...","description":"Finally got some plays out of this. Love it.\n\nOur first win in five plays happened once we used 4 investigators. Makes it a bit longer than I would like.","user":{"username":"sugarmeeple","id":"h4nd7ZV5hu"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"YChzc0GQ6N","date":"2020-01-10T23:36:02.965Z","rating":4,"title":"Streamline...","description":"Streamlined Arkham Horror? I must admit my first play of this went far longer than I would have thought possible... but am willing to give this +many+ more chances.\n\nI expect my rating of this to rise over time.\n\n[b]UPDATE:[\/b] This is still a long game. While it's not as lengthy as Arkham Horror is, it's deceptively long... which isn't necessarily a bad thing. What's far more important is that it's an enjoyable experience -- even if damned frustrating at times.\n\nHave had heads handed to us every single time it hits the table -- and it doesn't matter. It's still fun!","user":{"username":"Aaxiom","id":"rvJX0vHEgw"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"eRvW1wqctA","date":"2020-01-03T22:42:49.590Z","rating":2,"title":"Co-op so I...","description":"Co-op so I was never going to rate it well, also takes quite a long time so that drops the rating as well. Not bad for what it's designed to do, but I just don't want to play.","user":{"username":"Avron","id":"rZRAVFlqOc"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}},{"id":"BiNuqyEHic","date":"2019-10-29T07:07:52.649Z","rating":2,"title":"Nope, I do...","description":"Nope, I don't get why this is so much more popular than Arkham Horror. It just feels far more fiddly and random, and yet those are the things people say its improved on Arkham. \n\nFirst game I ever traded away","user":{"username":"3MBG","id":"Iq8eBovdNm"},"game":{"id":{"objectId":"ZwlnfX1J2z"}}}]