[{"id":"HFDHmTHz8h","date":"2020-07-20T14:02:28.497Z","rating":5,"description":"Late to the party with this one but yes yes yes. I will play this any time and maybe only with friends as it really is about that negation part of things where this shines  In my top 10","user":{"username":"Jon Dante","id":"x2tLaqb9Tw"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"6iHHuIbJet","date":"2020-04-01T20:21:34.191Z","rating":4,"title":"Played fir...","description":"Played first with no aliens and no flares to teach the family. Everyone from 9 to 40 caught on quickly, so I ran through a couple of Alien powers and then assigned them randomly.I love watching emergent strategies around the table as people try different things and different alliances. This one is going to run and run.","user":{"username":"andybeta","id":"iBINPaJZ01"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"vnwxmn23In","date":"2020-03-09T23:06:09.903Z","rating":4,"title":"Immediate ...","description":"Immediate hit with our group of mostly eurogamers. The wild alien powers are fun, fun, fun!","user":{"username":"opticode","id":"GOBGDBMHVT"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"KsWV3kVzY5","date":"2020-03-07T03:11:49.869Z","rating":3,"title":"3-5","description":"3-5","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"MlYAL4iDz0","date":"2020-03-02T19:53:08.065Z","rating":4,"title":"Fall 2014....","description":"Fall 2014. Started tracking games late. Add about 10 to the number of plays.","user":{"username":"RyanLopez","id":"s1SvjLpi66"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"i82i53WE5c","date":"2020-02-28T22:53:33.941Z","rating":3,"title":"I like thi...","description":"I like this game, although not as much as some.  I find that it tends to end too quickly.  Racial special powers can sometimes only be used once before the end of the game.  Negotiating aspect can make this one run long for our group.  Still, sci-fi theme is enjoyable and replay value is limitless given the huge number of different races.","user":{"username":"permagoof","id":"EE9k3rx1UU"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"hsdt2TLjqu","date":"2020-02-28T01:35:35.102Z","rating":3,"title":"The epic s...","description":"The epic space game of infinite possibilities!","user":{"username":"BGillz81","id":"wxvBXzSKgJ"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"mvVIeIfJNX","date":"2020-02-26T18:05:16.006Z","rating":4,"title":"Every alie...","description":"Every alien is OP and meant to break the game.  The only way this game can be bad is if all players get the draw of crappy aliens, which is rare.","user":{"username":"xmorridin","id":"bGnYPyAeQi"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"hXlSsG80P8","date":"2020-02-25T17:48:13.136Z","rating":3,"title":"FFG versio...","description":"FFG version is much better one than mine AH. I'll gladly play this one again.","user":{"username":"paka","id":"rp47DWzo8q"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"BztbkVp2uF","date":"2020-02-24T06:03:01.364Z","rating":3,"title":"I've only ...","description":"I've only played one game so far, I liked it a lot but the group I played with seemed lukewarm on it.  They seemed to get hung up on not having the \"right\" cards in their hand, maybe I just need to get them in the right mindset.","user":{"username":"Karmancer","id":"ciGO5bzTWu"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"aIzbBLcxWG","date":"2020-02-03T23:23:16.755Z","rating":5,"title":"First play...","description":"First played in the 1980's. It's a classic for a reason, simply epic fun. In space, everyone will hear you laugh!\nPeople say you must have the \"right group\" but that is basically true with any game right? BUT!!! What I think they mean is that the \"10\" out of this game is when you have a group of players that really get into what this game is all about: negotiation and variable player powers. One of the player can be an alien race that seems to have a power FAR better than everyone else's in the game, so it's up to everyone else to negotiate their way into victory and overcome the challenge of the other alien powers.... then again that's the cool thing... that's EVERY game. Every game is you and your alien power(s) trying to out negotiate and out maneuver everyone else so that you can be the first to gain 5 foreign colonies. \n\nYou have to play with folks that understand it's about fun, backstabbing, negotiation,  and winning... if you do all that, you will have one of the best times around a game table. \n\nNEVER the same game twice, seriously infinite replay-ability.","user":{"username":"Abysmul","id":"m0lvkCFxfB"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"McKYp7iXc7","date":"2020-01-31T20:43:59.569Z","rating":3,"title":"Fun negoti...","description":"Fun negotiation game! Really just a blast to play, and all the different alien races allow for just a really great and different experience every time. One great thing is scales well for any number of playings(never played with the 7 or 8th player). Always a great game to pull out at a game night.","user":{"username":"wallawalla4591","id":"8BduD9e5gV"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"B9ULCIb9WX","date":"2020-01-28T15:32:48.396Z","rating":5,"title":"Amazing fu...","description":"Amazing fun for the simplistic mechanics. Though initially it feels like a random luck draw, the amount of choice at the player's disposal nearly removes this entirely. Bluffing your cards, knowing when to strike hard, or gather allies and defend - it's an amazing game. And infinite replayability!","user":{"username":"Effervex","id":"oXk0xfkRr7"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"Aqll3kcfmw","date":"2020-01-26T03:31:26.248Z","rating":4,"title":"Yes, it's ...","description":"Yes, it's crazy--but there's a lot of underlying control. Add to that the constant necessity to wheel and deal, and you have a fair bit of power over your fate.\nAnd if not? The game should be over soon enough--reshuffle the alien cards and try out a new power.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"DBcz4BuyL1","date":"2020-01-26T00:09:50.942Z","rating":4,"title":"3-6\nBest w...","description":"3-6\nBest with 6","user":{"username":"TalksToChalk","id":"ttBznVfupr"},"game":{"id":{"objectId":"FVKaz7JhBO"}}},{"id":"HBw4avGiaO","date":"2020-01-25T03:04:12.838Z","rating":4,"title":"2\nxx","description":"2\nxx","user":{"username":"Arcshot","id":"Xpnrl5RFHA"},"game":{"id":{"objectId":"FVKaz7JhBO"}}}]