[{"id":"u5Jb8a1HZ6","date":"2020-07-20T14:03:55.336Z","rating":5,"description":"Great game, if you like this kind of game.","user":{"username":"Jon Dante","id":"x2tLaqb9Tw"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"SIKWCa70Cb","date":"2020-04-01T18:31:54.918Z","rating":2,"title":"The design...","description":"The designer clearly borrowed from Through the Ages here. unfortunately, the lighter game with a spatial mechanic and city-building theme doesn't compare to the game by which it was influenced. The end game scoring itself just ruins the game. Purchasing tiles and placing them in your burough in order to benefit from them. Spatial in the sense that where you place it relative to other tiles will affect your income or reputation. Score is population plus bonus points for specific goals at game end (goals change from game to game). Negative seems to be that start player is a pretty significant disadvantage with no benefit at all. End-game goals (most of x, or fewest of x) score between 10 and 20 points each, and ties go to no one. Three of these goals are face up for all players from the beginning of the game, but each player has one \"secret\" goal that only he knows about.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"Hbe4Oar0z4","date":"2020-04-01T02:53:32.120Z","rating":2,"title":"I just don...","description":"I just don't know what I think of this game.  There are some things that I really like about this game, the feeling you get while playing, the object is well thought out, etc.  But there are some things I really don't like.  Those goal tiles are a huge swing, and the private goals are completely random.  Some can be incredibly easy to get, some are near impossible, some can even be out of your control completely.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"lDQS0CDgg2","date":"2020-03-18T00:43:48.114Z","rating":4,"title":"1-4 player...","description":"1-4 players, city building, 60-90 minutes, medium-heavy.Works allright with two. Rating based on run through\/solo games. Played once with two players and that was quite nice, but with 3-4 it's probably too fiddly. I really like the theme and the game's mechanics and as a solo game it does scratch an itch, so I'll probably hold on to this one.This year there will be a luxury reprint of the game on KS, so very interested to learn more about it.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"Emcu7EYBeW","date":"2020-03-07T03:12:26.945Z","rating":3,"title":"1-4","description":"1-4","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"qoPpfmQbNl","date":"2020-02-25T17:58:01.588Z","rating":3,"title":"Seemed qui...","description":"Seemed quite nice game. Interesting decisions and good presentation. 1st game didn't have much (if any) tension at all, so thats quite a big miss for, even if mechanics were nice and I'd play it again.","user":{"username":"paka","id":"rp47DWzo8q"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"JWBvprtCri","date":"2020-02-05T09:12:10.938Z","rating":5,"title":"Easy yet complex","description":"Looks dry, but very funny. Brilliant and goes by in a flash. Incredible game","user":{"username":"gmale9000","id":"3pcAnC6iWh"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"P2XaEXT7Uq","date":"2020-02-03T22:55:31.584Z","rating":4,"title":"Box signed...","description":"Box signed by Ted in 2016 (at Pacificon)","user":{"username":"oddbod","id":"AVDMzTCTJU"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"qTN2mwOjw2","date":"2020-02-03T17:05:35.662Z","rating":4,"title":"Fun and st...","description":"Fun and strategic tile laying game, a little hard for first time players, but a great game","user":{"username":"bigwoodfence","id":"4LnCrAp3EW"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"JKVqGvPzSa","date":"2020-01-28T15:43:36.038Z","rating":3,"title":"One of my ...","description":"One of my few Euro-style games. A little slow at times, but very fun. A lot more aggressive than other Eurogames too, I find.","user":{"username":"Effervex","id":"oXk0xfkRr7"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"nM2CkAkHMO","date":"2020-01-26T03:51:34.676Z","rating":3,"title":"Awfully pl...","description":"Awfully pleasant and quick. Manages to hide its fundamental nature as multiplayer solitaire rather well. Rather easy to miss (potentially crucial) adjustments, though, so can get fiddlier than it has any right to be.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"kA63Ms4sof","date":"2020-01-25T07:41:41.089Z","rating":2,"title":"A relative...","description":"A relatively fun game, until you get to the point you realized you may have missed something in your scoring. Which can be near impossible to recalculate. If that could somehow be fixed it would probably rate a 9. Until then, I don't have much desire to play again.","user":{"username":"Lumpfuggit","id":"cCfRs764KL"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"gC4FjBTa2R","date":"2020-01-20T18:08:10.311Z","rating":4,"title":"http:\/\/www...","description":"http:\/\/www.coolstuffinc.com\/main_printOrder.php?orderID=864122","user":{"username":"javajoe96","id":"TVSY9G5uFc"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"GLuhRJzHcP","date":"2020-01-07T10:41:40.747Z","rating":3,"title":"Fun city b...","description":"Fun city building game.  Can be hard to alter strategy as you attempt to build an infastructure but are reliant on \"luck of the draw\" as to what buildings you can place in your city.  ","user":{"username":"danallbaugh","id":"aEy9Urgy2b"},"game":{"id":{"objectId":"fxxi8zX7L9"}}},{"id":"EMAnocDduW","date":"2020-01-03T22:57:55.294Z","rating":3,"title":"I played a...","description":"I played a couple of games, with a couple of guys that had played earlier. I didn't really know what I was doing or what should be prioritised. Knowing there are tiles that prevent loss of population\/reputation might have impacted some decisions, but the bigger thing is knowing how each tile is going to interact.","user":{"username":"Avron","id":"rZRAVFlqOc"},"game":{"id":{"objectId":"fxxi8zX7L9"}}}]