[{"id":"LTBcYgjGHF","date":"2020-05-14T15:15:58.614Z","rating":5,"title":"Just playe...","description":"Just played this game....it is too good!","user":{"username":"verysmallbeta","id":"F3J8EiTAzC"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"g4p9t5txnh","date":"2020-04-14T20:15:04.511Z","rating":4,"title":"The beer b...","description":"The beer barrel mechanism makes this game a little too cut-throat for me, but my brother in law absolutely loves this game and is an excellent player. I appreciate the design and what the game is doing, I just don't necessarily think it's for me.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"xzMgdIfHtN","date":"2020-04-01T02:13:54.796Z","rating":5,"title":"I like it ...","description":"I like it slightly better than the other version - but only slightly.  They are both 10\/10 games.  This one just has more options of what to do.","user":{"username":"TroyNyne","id":"FEjzD24EeL"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"cvst5YQTzU","date":"2020-01-25T00:22:27.646Z","rating":4,"title":"1st Impres...","description":"1st Impressions:\nThis is definitely a game where the complexity is hiding in the game and not the rulebook. Though there were a few fiddly action requirements that I couldn't remember to save my life, I eventually found and interpreted the iconography on the board; after that things went pretty smoothly. This is a very interesting game and I'm really looking forward to playing it more. It rewards long-term planning. The unique way you have to move deliberately into the second half of the game with only a few carefully chosen buildings makes this game really cool. Very satisfying.","user":{"username":"warder57","id":"iaobIrOTQm"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"HZcPCHQCfl","date":"2020-01-04T00:03:23.518Z","rating":5,"title":"Complex and Rewarding","description":"Deep game, not a lot of guidance on strategy. You will see the benefits of all different strategies the more you play and understand how everything works together...even players.","user":{"username":"nealkfrank","id":"CyqawCwHn9"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"tDHGSICUFt","date":"2019-12-12T17:33:01.156Z","rating":4,"title":"Pushed bac...","description":"Pushed back to July 2018\n\nLove the turn order, taking loans, and the differing long term strategies. Scales great between player counts too.","user":{"username":"smwoz17","id":"pOp3KFNl0D"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"2npHSzOMWf","date":"2019-12-03T19:31:44.896Z","rating":4,"title":"I really l...","description":"I really like this game. There is always something interesting to do. The resource marketplace is the most streamlined of any Martin Wallace game that I have played. The art is dark and evocative. The money is represented with nice heavy clay poker chips giving a real satisfying sensation of spending money. My only two minor downsides are first game length; my first game was a three player game and ran nearly 4 hours. I suspect it will decrease as I (and the  people I play with) get more proficient and if it can settle in the 2 to 2.5 hour range it will be perfect. Second, the card timer system is a tad bit fiddly, but I also think this will become a non issue with repeated plays.","user":{"username":"rarroyo","id":"76P6FtbgDC"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"pbEIarGzIX","date":"2019-10-25T04:30:56.324Z","rating":5,"title":"Too much of a good thing, but not really","description":"This game probably would benefit from repeat plays. It felt much less complex than the BGG rating would suggest, but I imagine it gets more complex the more experienced you are with it.\n\nI love how much the game state changes from one age to the next: at the end of the Canals age, I was winning handily, but by the end I lost by almost 60 points. The long-term engine building is crucial.\n\nThe game goes by a lot faster than you'd think. Our learning game took about 2 hours.\n\nEDIT:\n\nThe more I think about this game, the more I like it. Brass teeters on the edge of rules bloat, but never really suffers from it; instead, the fiddliness gives it depth and adds to the fun element. The best compliment I can pay this game is that it's a fun game to lose.","user":{"username":"rancidmike","id":"WBUGNAAmsD"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"tlW7Zn0mDa","date":"2019-04-22T17:43:45.183Z","rating":4,"title":"I late ple...","description":"I late pledged this game on Kickstarter after watching several solid gameplay videos (Ant Lab Games, Heavy Cardboard) and listening to my wife comment how boring the game looked.  Well, it turns out that my wife and I love to get this one to the table.  The simplicity in mechanics, coupled with the depth of decision-making, makes this one of our favorite games that we can play in about 2 hours.  This game has a great mixture of strategy and tactics that come together to create the win.","user":{"username":"trancendence_66","id":"FIqvPNDytG"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"p7crCGzIs1","date":"2019-04-12T18:18:54.690Z","rating":4,"title":"Learning 3...","description":"Learning 3 player game with Alastair and Lauraine.\nPreferred version with the beer !","user":{"username":"Robertcompton","id":"Z2vesScdom"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"OPFCJPRqOB","date":"2019-03-01T19:14:54.750Z","rating":4,"title":"Sleeved","description":"Sleeved","user":{"username":"ion514","id":"5m4MFdG580"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"X1s4y7SF93","date":"2019-01-24T17:36:44.043Z","rating":5,"title":"Best game of this type","description":"Love this game. Played a few times and can’t wait to play it again.","user":{"username":"Cratus","id":"ZpZjDXRzrn"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"x7BStOB1pm","date":"2019-01-23T14:28:01.490Z","rating":4,"title":"The edges ...","description":"The edges have been sanded down from its predecessor, far less aggressively competitive than the original due to the new resource constraints. What results is less of a knives-out fight for rail network territory and more of a nuanced balance of parallel competitive interests.\n\nWith three industry goods, the game is open to \"multiple paths to victory\" that so many people laud as a positive attribute. I usually find this dull as it often pits you against the game more than your opponents. This paradigm is more apparent at the lower player counts, since two or three players can pursue different paths without bumping heads.\n\nIn 4p, someone is going to get in your space on at least one-- and potentially several-- of the directions you're headed.\n\nBeer is kind of the exception to this. On the one hand, beer is to blame for the new restrictions that tie players' hands, slowing down the double-rail spam strategy forcing people down the one of the aforementioned \"multiple paths.\" On the other hand, beer is the one resource that all players really need in the Rail era, and I wonder if the knife fight appears with breweries as players become more skilled.\n\nThere's still an important timing aspect to getting breweries out. If you want to use your own breweries, you had better make sure nobody else can access them. \n\nI don't like Birmingham [i]better[\/i] than Lancashire, but I do like it [i]differently[\/i].","user":{"username":"Brent","id":"MQlPznxyCZ"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"iRMzS0cnBJ","date":"2019-01-16T17:52:43.957Z","rating":4,"title":"Why do I s...","description":"Why do I simultaneously feel so dumb and so smart playing this game. It's one of those ones where analysis-paralysis prone players may experience full brain meltdowns. \n\nI have no idea how to play this properly. Flipping tiles is fun. Having others flip your tiles is fun. Trains!","user":{"username":"svenv","id":"yWHHZvqNUM"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"yDhhTrGAOM","date":"2019-01-15T22:32:31.653Z","rating":4,"title":"Initial im...","description":"Initial impressions low, but need to play again. Seems like someone has to become the Beer Baron for the game to work at all.","user":{"username":"frankqb","id":"SmobI37Fga"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"IfnXjBynd6","date":"2019-01-11T05:01:32.658Z","rating":4,"title":"Brass: Bir...","description":"Brass: Birmingham is a captivating design that will immediately appeal to strategy gamers. The intermingling of the various industries creates rich player interactions and creates a strong foundation on which its economy stands. The result is a somewhat opaque game system that equally invites strategy and opportunism. The comparison to its predecessor it inevitable, but Birmingham more importantly embodies the strengths of iterative design. The Brass system is rich with thought and has much to offer, and is one that I aspire to master.","user":{"username":"ekloff","id":"a8RJxg0qVT"},"game":{"id":{"objectId":"3IPVIROfvl"}}},{"id":"X7BYNdyhIA","date":"2019-01-09T17:27:13.483Z","rating":5,"title":"y...","description":"y","user":{"username":"Mikeside","id":"ZMXfyiB2ky"},"game":{"id":{"objectId":"3IPVIROfvl"}}}]