[{"id":"5fRlLZkfiT","date":"2020-08-05T15:24:24.452Z","rating":4,"description":"The Rulebook is a bit of a mess, but you can manage it. The only issue I have with the components is the player boards, as you really do need an overlay - otherwise you have to worry about bumping the table just a smidge and you are all messed up. That aside this is a sold engine building game, the theme comes through surprisingly well. I have played mostly as a solitare game and it is very good at that. The multiplayer game has some mean aspects to it that I am not sure I love, but time will tell.*11.28.2018 - Decided I would rarely like this as a multiplayer game, but it is amazing as a solo experience.","user":{"username":"povertidonki","id":"eqPHRjtz0E"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"CkJZJP2nPH","date":"2020-07-20T14:05:20.303Z","rating":5,"description":"I’m sure many others have said enough about this game. It makes my brain fizzle","user":{"username":"Jon Dante","id":"x2tLaqb9Tw"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"q8DpCHAtMe","date":"2020-07-19T15:38:07.644Z","rating":4,"description":"Solo","user":{"username":"Vucora","id":"Gd7ghgvUUq"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"MLlliLJsE4","date":"2020-07-15T18:15:23.167Z","rating":4,"description":"BGG - Trade","user":{"username":"07734","id":"OeawAe30Dc"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"wOdwmPhTUD","date":"2020-06-19T18:40:22.865Z","rating":3,"title":"No Review Title","description":"No Review Description","user":{"username":"Kid_A","id":"6QGYiFEZxA"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"Y7Axsq1CF3","date":"2020-04-14T20:21:50.380Z","rating":5,"title":"Shit compo...","description":"Shit components, shit rulebook, shit art, and one of my favorite games I've played. After the initial headache of learning to play, and warning players around the table to be careful to not knock the boards, we all wound up having an absolutely wonderful evening. PHENOMENAL game well worthy of #4 on the overall list, but the cost may be a barrier to entry for many folks, especially given how shit the components are. LOVE THIS GAME.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"yLux3Ikqv9","date":"2020-04-01T02:53:37.961Z","rating":2,"title":"Extremely ...","description":"Extremely fiddly, has some good elements, but takes a while and is kind of random with the cards,  If you play with a draft, sure it'll be better, but it would also be longer, much longer.  And there might be too many cards for that kind of thing anyway, as you would not breed much familiarity with the deck since I believe all the cards are unique and it's like 200 long.  Agricola already did this and does it while being easier to teach and more intuitive on what the player is supposed to do.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"8J2zkkh3Vz","date":"2020-03-24T18:56:21.443Z","rating":3,"title":"Amazing, w...","description":"Amazing, well designed game. There is ONE thing that threw me off when I opened the box: the graphic design is very amateur. Being a graphic designer myself I always get excited when I see pieces like Mechs VS Minions, Tiny Epic Quest and others with a thought out, well planned graphic design. Typography in this whole set is horrible. The cards are barely readable, color contrast is poorly chosen and they were made to value the photograph that is portrayed in them. This could have been done so much better.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"vRAmt9donj","date":"2020-03-18T00:43:56.234Z","rating":5,"title":"1-5 player...","description":"1-5 players, best with 3-4, can also be played solo. Medium heavy euro. Really like the theme and the mechanics, and decided to add it to the collection in a trade. While playing, it doesn't feel very thematic though, as the cards usually aren't read thoroughly (it's more about the symbols on the cards). However, with some effort the theme certainly: just read the cars, most of them are well thought through and make perfect sense from a thematic perspective and do add to the story line.Next to a couple of multiplayer games (with 2 and 3 players), I've also played a number of solo games. It can be quite challenging to meet all the hurdles before time runs out. So far, scores have been all over the place. But I like that, your decisions (and -to some extent- luck of the draw) do impact your game quite a bit, but usually, the better player does win the game, as building your engine successfully is a major part of the (winning) strategy. So far VERY happy with this addition. Have also played this with my son and he REALLY likes it.Cannot recommend this enough. What a great game! Definite keeper in my collection and in my top 10.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"Kxch59DaQS","date":"2020-03-07T03:12:39.063Z","rating":5,"title":"1-5","description":"1-5","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"sbdN3o77LS","date":"2020-03-05T15:09:07.696Z","rating":4,"title":"I've only ...","description":"I've only played this once at 4 players. A little slow to get going because 1) we were all new 2) you have to build the engine, but I think we all \"got it\" by midgame and by the end I had a nice little engine running. I don't have any upgraded player boards (which I recommend). I enjoyed this one and would definitely play it again.","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"YeuhlVt8qg","date":"2020-02-28T23:05:20.422Z","rating":4,"title":"This ratin...","description":"This rating has more potential to go down rather than up, but it's a solid 8 for me right now.  I can see where the luck of the draw might become an issue over the long haul, though.","user":{"username":"permagoof","id":"EE9k3rx1UU"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"ROnlyv6OFD","date":"2020-02-28T01:36:41.886Z","rating":4,"title":"Its a game...","description":"Its a game that deserves its praise. One of the best.","user":{"username":"BGillz81","id":"wxvBXzSKgJ"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"TRmvlFVAzA","date":"2020-02-25T17:58:08.372Z","rating":4,"title":"Its a good...","description":"Its a good game, even very good... but I don't get that overhype it gets. Felt a bit similar to Race for the Galaxy as its basicly cardgame where cards get dealt from one pile and you just have to somehow figure out how to best play these to further your own goals. Might be I need more plays to start appriciating it more. Don't get me wrong, its a good game still","user":{"username":"paka","id":"rp47DWzo8q"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"6P5t5fB4sx","date":"2020-02-05T15:09:15.208Z","rating":5,"title":"No Review Title","description":"No Review Description","user":{"username":"Xarbnot87","id":"IG4YzFDfwa"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"2xLLH9QVlv","date":"2020-02-03T17:05:37.369Z","rating":3,"title":"Fun game w...","description":"Fun game with solid mechanisms, but did not stand out too much for me. Also the card art\/graphic design is terrible.","user":{"username":"bigwoodfence","id":"4LnCrAp3EW"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"RMeChglSIC","date":"2020-01-29T04:23:19.094Z","rating":5,"title":"This was t...","description":"This was the game that really pulled me into board gaming. It was wonderfully intricate while not becoming overwhelming. It struck a fascinating balance of providing complex mechanics while also maintaining an intuitive execution.","user":{"username":"Jadam","id":"Xv0McQC3YN"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"QFDFhzpUjz","date":"2020-01-28T20:35:58.094Z","rating":3,"title":"I've playe...","description":"I've played it many times now, and it's always fun but some aspect falls flat for me that I can't put my finger on.","user":{"username":"JohnTaylor","id":"EPNHNHSPfg"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"Arh7T6H6p6","date":"2020-01-26T19:05:20.235Z","rating":5,"title":"Amazing ga...","description":"Amazing game. All the whiners about the components or people that claim to knock the cubes around \"multiple times per game\"?  Ignore them.  Components are fine.  Card artwork is great for me.  Learn how to control where your hands and elbows are.  Enjoy the game immensely every time I play, win or lose. I will play with or without drafting.  Once you know the various paths and strategies, I do not see drafting adding gobs of time unless you have an AP animal playing.  I have to admit - it's not fun when people target your plants with asteroids, haha.","user":{"username":"ab999","id":"uIetiCqrHE"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"GebnDp5RDS","date":"2020-01-26T03:51:52.144Z","rating":3,"title":"A perfectl...","description":"A perfectly pleasant multiplayer solitaire tableau-builder, the pointless and grotesquely arbitrary take-that attacks notwithstanding. I'd rather play Race for the Galaxy or Ginkgopolis or 51st State or many others, as they are faster and arguable have more player interaction, but there's nothing especially repellent about this one.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"ASWeKsAIQl","date":"2020-01-25T10:34:00.480Z","rating":4,"title":"The best t...","description":"The best tableau\/engine builder I've ever played! Very thematic! \n\nA common complaint is that the components are not very good and I definitely have to agree. $70 is way to much to pay for thin cards and player boards and stock photos. Luckily the price dropped down to sub $50. However, the game itself is excellent and has become one of my all-time favorites despite this.","user":{"username":"Deucejack","id":"mGrdNHgXEE"},"game":{"id":{"objectId":"fDn9rQjH9O"}}},{"id":"oZmCFqNX3T","date":"2020-01-25T07:42:05.414Z","rating":2,"title":"After more...","description":"After more plays I am liking this game less and less. \n\nI am not sure the best way to explain this. But it feels like I am learning the game for the first time every time I play it. Yeah I get the basics. But I guess I don't play it enough to feel like I am gaining a grasp on the game in general. Or maybe the boring nature of the theme, or as I like to say, \"the lack of theme\" disinterests me. Yeah you are supposed to be of course terraforming mars. But it does not feel like that at all for me, despite all of the cool components, art, and board. Every time I play it just feels like a card game, with too much text, and takes way too GD long!! Seriously, can anyone even name one card that they have in their tableau when done?? Maybe the uber fans that have played it 50+ times? I don't know, I would rather play something interesting during those 5+ hours.\n\nIt is a good game for those it is targeting. Obviously it has a following. I will\/would give it another chance maybe, if in the mood. But I can't honestly picture when that would be.","user":{"username":"Lumpfuggit","id":"cCfRs764KL"},"game":{"id":{"objectId":"fDn9rQjH9O"}}}]