[{"id":"DEEM0IBLWB","date":"2020-06-20T10:29:02.609Z","rating":5,"title":"This is more than just a board game","description":"What an experience.","user":{"username":"SandroF","id":"deWy3yFEqz"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"adMyCxr4Nz","date":"2020-05-03T15:05:46.479Z","rating":5,"title":"This is ju...","description":"This is just a masterpiece. So engaging and memorable.","user":{"username":"SonofLars","id":"hIPmS6Krov"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"bK8Wuj7ed1","date":"2020-04-01T02:51:58.879Z","rating":3,"title":"So far two...","description":"So far two games in, and I am enjoying the game.  I wouldn't call it amazing or anything just yet.  But we'll see I guess.  Maybe it will be more amazing later.It is compelling playing a game not knowing what is coming but knowing that something is.  You don't get that kind of experience from games very often.2017-07: We've finally finished the game, and while I enjoyed the experience, it is mostly pandemic, with an overarching storyline.  Although many of the plot elements were interesting, and I enjoyed going through them.  In the end, during the final stretch, the game started to feel samey, and if it were a great game, that would be fine, but like I said, I wouldn't call it amazing.","user":{"username":"SybotCB","id":"zHzcYgmRew"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"GBPTX22Vlg","date":"2020-04-01T02:18:26.861Z","rating":5,"title":"Takes a de...","description":"Takes a dedicated group to play all the way through this, but we enjoyed the whole ride. Looking forward to season 2.","user":{"username":"TroyNyne","id":"FEjzD24EeL"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"gFiImwWwGI","date":"2020-03-25T01:34:25.107Z","rating":3,"title":"Really enj...","description":"Really enjoyed the first 6 month of the game. 9 starSecond 6 month felt like work at some point, dissapointing how linear the story is, was expecting the story to have different path and ending.","user":{"username":"paris1979","id":"hnZcaO8d7j"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"i8kB2mdBZj","date":"2020-03-24T18:56:06.658Z","rating":4,"title":"We´re lovi...","description":"We´re loving the legacy version. It is scary, tense and the surprises keep coming!","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"X8xvi1GMqC","date":"2020-03-18T00:42:48.481Z","rating":4,"title":"1-4 player...","description":"1-4 players, 60-90 minutes, action point system, cooperative.First few games were a walk in the park (with 2 players, which apparently is a little easier), but as a result of various plot twists, the game does become a lot more challenging at times. Overall, it was a very good experience and I was very happy to have played it. Unfortunately, all good things must come to an end. Still on the fence whether I should try Season 2 as well given the mixed messages. Also, playing a full campaign requires a lot of commitment as well as time and there are so many other games I want to play as well (including other campaign games). Therefore, will not acquire S2 just yet.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"hPKLwUSZXs","date":"2020-03-11T17:06:41.886Z","rating":5,"title":"Amazing co...","description":"Amazing co-operative experience, definitely worth the investment.","user":{"username":"redrooster555","id":"0oK9LLTONU"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"4ajqWqC8GK","date":"2020-03-07T03:12:15.372Z","rating":4,"title":"Blue","description":"Blue","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"DT6NGspmHW","date":"2020-02-26T18:08:29.883Z","rating":4,"title":"Love playi...","description":"Love playing this with my family.","user":{"username":"xmorridin","id":"bGnYPyAeQi"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"UNK6CpV5ws","date":"2020-02-19T17:05:29.629Z","rating":5,"title":"Détruit da...","description":"Détruit dans la joie et dans le feu à Piopolis. Adieu, Dr. Sal Monayl, vos services furent précieux!","user":{"username":"mononk","id":"z529p3F7Xb"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"B6RtG0r3AU","date":"2020-02-14T22:08:50.052Z","rating":4,"title":"My first l...","description":"My first legacy game. I already love Pandemic and this makes it even better.","user":{"username":"g6grim","id":"zukWhgG8u5"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"G6hTtMWldF","date":"2020-02-05T16:04:07.010Z","rating":5,"title":"This game ...","description":"This game lives up to every ounce of hype it has received. I played through the entire game in a 24-hour charity marathon event (finished in 19.5 hours, actually), and even though we lost both games in December, we came REALLY close to winning, and that made the effort all the much more enjoyable. \n\nWhen you're instructed, in the middle of the FIRST GAME, to destroy a component, you realize that you're in this thing, there's no going back, and by God, you're going to see it through to the end. I would definitely pay full retail for this game again and play it through again . . . just not in a 24-hour period.\n\nIf you like Pandemic, you will love this game.","user":{"username":"BackBurnerGames","id":"bLRwfwEKuF"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"UX8bNgeziH","date":"2020-02-02T10:05:54.914Z","rating":4,"title":"Ranking of...","description":"Ranking of 9 during mid season of the game. Really enjoying it and like the evolution of the game from basic pandemic forward.","user":{"username":"Bazooka13","id":"UzHJdjLCjG"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"FVPGAVyvuI","date":"2020-01-31T20:46:23.576Z","rating":5,"title":"Number one...","description":"Number one that's all I can say.  It's only a 10 because BGG won't let me rate it higher.","user":{"username":"wallawalla4591","id":"8BduD9e5gV"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"AA1ieRE81y","date":"2020-01-28T15:42:56.937Z","rating":4,"title":"Played thr...","description":"Played through from April to December. Great fun, and a compelling story.\n\nBought again in NL.","user":{"username":"Effervex","id":"oXk0xfkRr7"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"6mEGRaHCDe","date":"2020-01-26T03:49:05.389Z","rating":3,"title":"Yeeeeah. S...","description":"Yeeeeah. So.\nThis isn't as good as I thought\/hoped it would be. Make no mistake, it's very good--but the Legacy format isn't really shining. For one, everything is scripted in a way that Risk Legacy wasn't. For another, the new stuff that the boxes and stickers introduce is mostly just a subset of the stuff Pandemic lovers already have in the expansions.\nYou see, I still prefer normal Pandemic with the first expansion, because it has tremendous variety and customizability. Lots of roles, events, and options. With Pandemic Legacy, you just a small subset of that locked in month on end.\nSo, from my perspective, don't believe the hype--especially if you're like me, and you think Pandemic doesn't really sing until you add On the Brink.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"sz5PWLw2wq","date":"2020-01-25T09:33:27.074Z","rating":4,"title":"I have Blu...","description":"I have Blue box, and Wife has Red box.","user":{"username":"kattattack22","id":"MQwJdAIPyJ"},"game":{"id":{"objectId":"mce5HZPnF5"}}},{"id":"uB1q8VRHte","date":"2020-01-25T00:24:58.960Z","rating":3,"title":"Game 3: I'...","description":"Game 3: I've definitely gotten a few rules wrong, but I've been enjoying this game quite a bit so far.\n\nGame 7: I'm enjoying the tweaks to this game. It keeps it fresh and interesting. But doing this solo means I consistently get pretty significant rules wrong. There's just a bit too much going on. Also, I'm starting to feel what my friend said: \"it's cool, but it's still just pandemic.\" I do want there to be some more fundamental changes. Idk if there will be or not.","user":{"username":"warder57","id":"iaobIrOTQm"},"game":{"id":{"objectId":"mce5HZPnF5"}}}]