[{"id":"UeMl3AyNl6","date":"2020-06-08T15:35:14.991Z","rating":4,"title":"Just great fun","description":"This game is just fun. Really simple rule set, lots of variability in the base game and lots of options to differentiate your bag and strategy from other players. Not every book is equally good, as one or two I don't much care about but since there's a nice pool to choose from, that doesn't really matter. The luck is used in this game to create tension and interest between players and their turns. Sometimes its tough to loose cause of a series of bad luck turns but that's really the point. A great game to counterpoint dryer or more complex games.","user":{"username":"lanista","id":"E7q1E8FblY"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"jzwJTVd8e7","date":"2020-04-18T03:21:22.567Z","rating":4,"title":"after the ...","description":"after the first few games i would say that this is a must-have game. Its easy enough to learn and teach and the amount of variability in the base game is incredible. i love the artwork and how it looks on the table. I didnt give it a 9 or 10 because i feel that the base game should have 5 players. the cardboard pieces seem like they will wear over time (ive also seen that confirmed in reviews) which means you have to get the upgrade pieces adding an expense to the game. The bags it comes with have an issue of the pieces getting stuck in the cornersand there just is not much player interaction. There is also an issue that a player CAN run away with this game in the middle rounds leaving everyone else behind. There are catch-up mechanics but you need the lead player to blow up to really make it back.despite those complaints holy cow, is this game still fun. it is the perfect game for before, after or between something with more weight to it. It is also the perfect game for a just a couple people hanging out with little to do.It scales great too, ive played at 2 and 4 players and felt the experience was equally great. For those looking for a game with their partner who isnt that passionate about Board Games this has been a winner for me and my wife.i will most likely buy the expansion the first chance i get, if only to add the 5th player. 8.5\/10","user":{"username":"MJay1010","id":"RoZTbOrGyk"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"34EwKZ6POz","date":"2020-04-14T22:13:54.082Z","rating":4,"title":"Very fun p...","description":"Very fun push your luck game.","user":{"username":"aWD5pzAHDusMLBDpaBBj4goWk","id":"Rm4ytuKcs0"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"F2NMTeGfdy","date":"2020-04-14T20:22:15.889Z","rating":4,"title":"Probably t...","description":"Probably the most fun bag builder I've ever played and certainly the most rewarding. I enjoy this game immensely and loving showing it to folks who don't really play games.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"JNjWyYnXtB","date":"2020-04-14T20:22:15.730Z","rating":4,"title":"Probably t...","description":"Probably the most fun bag builder I've ever played and certainly the most rewarding. I enjoy this game immensely and loving showing it to folks who don't really play games.","user":{"username":"SteezyStan","id":"q16YP2lDw1"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"zPYbLOXzb3","date":"2020-04-01T02:19:16.841Z","rating":4,"title":"This is a ...","description":"This is a great family game.+ Great push your luck elements+ Interesting spell books + Simple to understand\/play - After 5 plays I feel I need to upgrade the chips- A few more spell sets would be nice - Player interaction is almost totally absent","user":{"username":"TroyNyne","id":"FEjzD24EeL"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"pD1nXNeM70","date":"2020-03-24T18:56:25.212Z","rating":4,"title":"Oh I so lo...","description":"Oh I so love the thrill this game gives me. It is so juicy with luck and choices, luck and choices. When it's over, you want more. That's what I look for in a game.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"KLZvIJjfrg","date":"2020-03-18T00:26:58.846Z","rating":3,"title":"Rating bas...","description":"Rating based on 1st game.","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"zGsipWpjtp","date":"2020-03-05T16:07:35.587Z","rating":4,"title":"Dip your h...","description":"Dip your hand in that bag of excitement!","user":{"username":"MrShankley","id":"H6NZWH7Pm3"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"8OFe9ncLgM","date":"2020-03-05T15:09:08.901Z","rating":3,"title":"I bought t...","description":"I bought this one because: 1) good reviews & 2) a game to play with my daughters. Game was pretty easy to setup and get going. My daughters understood the rules and the strategy of earning points. We really enjoyed it and my youngest daughter won the game by 1 point!","user":{"username":"jasonberube","id":"D7oMBOfsNM"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"q8sD3TNWGO","date":"2020-03-04T19:42:51.939Z","rating":4,"title":"this game ...","description":"this game has one of those simple mechanics that is easy to explain to beginners, but satisfying to a gamer. The push your luck element has a very good tension to it.","user":{"username":"antiussentiment","id":"jqE5Gn3RFW"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"I3Xcv8Db6h","date":"2020-02-28T01:36:46.437Z","rating":4,"title":"Interestin...","description":"Interesting game. Fun!","user":{"username":"BGillz81","id":"wxvBXzSKgJ"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"39hrWkSBGq","date":"2020-02-26T07:00:11.800Z","rating":4,"title":"No Review Title","description":"No Review Description","user":{"username":"Zoron","id":"ZuDdury3pW"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"WkicZ5X8Lq","date":"2020-02-15T19:00:36.240Z","rating":4,"title":"A truly te...","description":"A truly terrible name for a game. Even in German though this was a lot of fun! It didn't really do anything new, but the art was charming and the push-your-luck part was very fun. Strategy-wise maybe not so much...a few games in the basic strategy seems to be to get as many chips in your bag as possible early on. Even though there's a catch-up mechanic it never seems quite good enough and the rich continue to get richer. Even with that though, it's still enjoyable to play (think Potion Explosion). Every gamer already has five games that do everything this game does but none in this exact combination so I can see it having a good run.","user":{"username":"Blap The Smaker","id":"2nAlqZMPU7"},"game":{"id":{"objectId":"M7r9tO1GbX"}}},{"id":"QPCE1reBdf","date":"2020-01-26T03:52:12.227Z","rating":2,"title":"That was p...","description":"That was pretty dumb, drawing your 3 first so often. Git gud, nub.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"M7r9tO1GbX"}}}]