[{"id":"6YGVYwgFJe","date":"2020-07-26T11:36:08.530Z","rating":4,"description":"Location: Closet","user":{"username":"lexjudex","id":"CGBCFjYBAn"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"6s92BDjtPh","date":"2020-07-24T05:20:53.883Z","rating":4,"description":"BGA","user":{"username":"sangwoko","id":"ASh49hEcAE"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"V6vo6jaw1u","date":"2020-07-20T14:02:31.263Z","rating":4,"description":"Good started game for the genre. Not sure if i'll play it again","user":{"username":"Jon Dante","id":"x2tLaqb9Tw"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"Dn2MNIGQgz","date":"2020-04-02T07:29:29.413Z","rating":2,"title":"","description":"A good introduction to worker placement games, with luck elements helping aide in teaching so that it doesn't feel like its always super tactical. Gets stale a little too quickly.","user":{"username":"thewoodknight","id":"Ie5tvaya8x"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"i6ya9k0ikQ","date":"2020-04-01T18:31:53.867Z","rating":3,"title":"Not bad fo...","description":"Not bad for a lighter worker-placement, but I'd rather play Pillars of the Earth for the same duration. Update: This is very easy to teach, and quick to play. Further bonus points for scaling well from 2-4, whereas PotE is good with only 3 or 4, and merely \"okay\" with just 2.","user":{"username":"Desiderata","id":"cClEsRiglP"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"1gcIB97y7P","date":"2020-03-24T21:11:32.644Z","rating":2,"title":"Too much l...","description":"Too much luck in the game for me.","user":{"username":"joeaar","id":"pV9nLlKU68"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"As71HaE8HT","date":"2020-03-24T18:56:17.090Z","rating":4,"title":"Some might...","description":"Some might hate the luck factor in games, but I love it in Stone Age. It's is really fun to chuckle some dice to gather resources and having tools to invest your duce result. Has strategy to it without being tiresome specially to new players. A very good strategy worker placement game for the whole family.","user":{"username":"guzforster","id":"BXzlhlqwCb"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"bk0WjGA1mL","date":"2020-03-18T01:49:13.972Z","rating":3,"title":"Weight: 2....","description":"Weight: 2.50 \/ 5","user":{"username":"OdysseusX","id":"P0X8HlAGpi"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"LQhuwwcck0","date":"2020-03-18T00:43:46.005Z","rating":4,"title":"Designer: ...","description":"Designer: Bernd Brunnhofer Artist: Michael MenzelPublisher: 999 GamesPlayer count: 2-4 (best with 4)Weight: medium lightMechanics: worker placementSetting: PrehistoryTheme: fairPlay time: 60-90 minutesHaving played over 70 games, I can fairly say this is one of my favourite games.Stone Age is a so called worker-placement game, which sets in the Stone Age. The goal of the game is to collect resources (wood, brick, stone, gold) to build huts and buy development cards which help you collect victory points. It is of course vital to feed your meeples every turn, if you cannot than you will lose 10 victory points each turn. As soon as the huts or the development cards run out, the player with the most victory points is the winner of the game.I personally think the theme is very appealing. The board looks very nice and the resources components (all wood) are very nice as well.Setting up the game only takes a few minutes, so you're ready to play in no time.Stone Age plays fast and rather easy, everyone can play this within a few minutes. There is little down time and not much chance of AP. The (7) dice add some luck to the game, but in a good way as you have to use these all the time, so the luck component should even out. Also, the starting player moves per turn, so everyone gets the chance to choose first.The routes to succes can differ, there is not one single strategy. After two games it becomes rather clear what works and what doesn't, so the advantage for an experienced player is limited to one or two games. The development cards are key to winning the game, but everyone is aware of that, so that's fine as well. On occasion, not feeding you meeples could be worthwile, when there are very strong cards or huts for grabs, but so far I've not played the game with the starvation strategy and have won probably >90% of all games I've played.I've played numerous games now, with 2, 3 and 4 players including a number of first timers. It plays well with any amount of players, which I consider a bonus as not many games do. Although the first game may take well over 2 hours, with experienced players you can play a game within the hour.There is also an expansion available which allows you to play with 5 players and which adds trading goods. Personally, I prefer the original and have traded away the expansion. I'm a big fan and want to play this again anytime! I have not found any downsides to this game yet. I rate this game 10\/10!Please check my review at:https:\/\/www.boardgamegeek.com\/article\/14576397#14576397Donated to De Camp on 05-05-2019","user":{"username":"DeKerstman","id":"A9dhwypSMo"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"xnD2JLwa3y","date":"2020-03-09T23:12:45.140Z","rating":3,"title":"Our first ...","description":"Our first game was very enjoyable, and I suspect this will be played a lot.UPDATE: has been very popular with everybody that we've introduced it to, and who doesn't enjoy a good starvation strategy ;-)","user":{"username":"opticode","id":"GOBGDBMHVT"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"KxD6gMDt3V","date":"2020-03-07T03:12:26.290Z","rating":4,"title":"2-4","description":"2-4","user":{"username":"Enduro","id":"XXjHIAff8d"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"tcPDR6SH8i","date":"2020-03-04T19:42:44.269Z","rating":3,"title":"the dice m...","description":"the dice make this game more suitable for those who are not so serious at the table.","user":{"username":"antiussentiment","id":"jqE5Gn3RFW"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"LL0I2RWCC6","date":"2020-02-28T23:05:02.268Z","rating":3,"title":"My main is...","description":"My main issue with Stone Age is that it cannot handle 5 players.  The most popular game with wife-friends and usually the first \"next step\" game I introduce new gamers to after Ticket to Ride.  After so many plays, we can set up and whack through a 4 player game of SA in about 75 minutes, and it's usually an open question as to who will win right up until the end.","user":{"username":"permagoof","id":"EE9k3rx1UU"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"1otJluOGME","date":"2020-02-25T17:58:00.385Z","rating":3,"title":"Beautiful ...","description":"Beautiful worker-placement. Dice is nicely compensated and the system works as a whole. After initial plays not really wanting to break this open. Too long for what its offering. (think it misses plays aswell)","user":{"username":"paka","id":"rp47DWzo8q"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"iG0QdKmCaa","date":"2020-02-24T06:04:18.547Z","rating":3,"title":"I like it,...","description":"I like it, it has very nice design and quality components; I have a strong sense that there are other games out there that might do what it does better and it will probably loose some of it's luster as I play more of these types of games.","user":{"username":"Karmancer","id":"ciGO5bzTWu"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"F3uzqQ2bIS","date":"2020-02-14T22:09:01.068Z","rating":4,"title":"Initial ra...","description":"Initial rating 9. Awesome gameplay but felt a little too long.\n\n(Jul 10) Raised to 10. This is so simple to teach, has beautiful art, fun of dice rolling combined with multiple strategies. Keeps coming back to the table with great success at 2 and 3 player counts. We are also now much faster at finishing the game. It really feels like a classic design.","user":{"username":"g6grim","id":"zukWhgG8u5"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"gCJwwVfKNK","date":"2020-02-03T18:10:13.988Z","rating":5,"title":"One of the best gateway games, with more depth","description":"Worker Placement game! great for beginners.","user":{"username":"WineScar","id":"31makDwKZA"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"Zai1a9lQ8l","date":"2020-01-26T03:51:28.609Z","rating":2,"title":"Now I am v...","description":"Now I am very forgiving to derivative games, but I am not forgiving to overlong games. Stone Age is both derivative and overlong. It wants to be 45 minutes, but is closer to 90, and can drag to 120. To be fair, Stone is awfully pleasant--a solid worker-placement game. But it's not as good as Leonardo, Age of Empires, or Pillars of the Earth given its length.","user":{"username":"Gyges","id":"33SQHhOEDt"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"UrVnT5UvFd","date":"2020-01-25T05:59:50.324Z","rating":4,"title":"[b][size=1...","description":"[b][size=12][BGCOLOR=#C0C0C0]Sleeved[\/BGCOLOR][\/size][\/b]\n","user":{"username":"kentdavies","id":"LiAt0DjAeB"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"OrfgkSt2g9","date":"2020-01-13T17:07:36.247Z","rating":3,"title":"November 2...","description":"November 2013: Originally rated 8\nJune 2016: Rated 7.5. Good, beautiful looking but a bit bland.","user":{"username":"sugarmeeple","id":"h4nd7ZV5hu"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"B9Cdvd7yO1","date":"2020-01-04T05:36:42.561Z","rating":3,"title":"One of the...","description":"One of the best worker placement games out there","user":{"username":"drzodiacus","id":"XfC1VYqrb0"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"H1rJGgxEKA","date":"2020-01-03T22:57:55.076Z","rating":3,"title":"I played t...","description":"I played three games in a 24 hour period (with practically everyone new to the game) and enjoyed all three games. Different numbers involved change the dynamics of what can be taken by whom and each player, after working out the rules, seems to have a different idea as to best strategy.\nSo far this seems to be the single worker placement game that I'll actually go out of my way to play.\n\n2008-12-05 Have been informed that there was a problem in the rules interpretation (my fault) and so I may have to change my rating of this after a couple of games with the correct rules. I don't think it will impact on my enjoyment significantly though.\n2008-12-10 Having played with the right rules I'm not changing my rating down, it may go up.\n2008-12-31 Up it seems, my third 9.\n2009-12-01 After a year it's dropped back. Mainly as a result of excessive 2-player games.\n2019-11 A decade on and I'm possibly selling it. There's almost always going to be something I'd rather play due to the amount I've played it.","user":{"username":"Avron","id":"rZRAVFlqOc"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"FoxSXeFbYR","date":"2020-01-02T19:31:35.907Z","rating":3,"title":"My introdu...","description":"My introduction to worker placement and still a game I greatly enjoy. For its weight, I am not sure what game does WP better (though I haven't played Lords of Waterdeep yet).","user":{"username":"Squirrelhenge","id":"WzAPf81sGs"},"game":{"id":{"objectId":"BUDJJb08Uj"}}},{"id":"aoVM4CWkzQ","date":"2019-12-20T22:39:53.713Z","rating":3,"title":"It's ok, b...","description":"It's ok, but I'd much rather play Lords.","user":{"username":"AndyMesa","id":"dW0VtNrQ1u"},"game":{"id":{"objectId":"BUDJJb08Uj"}}}]